document.addEventListener("DOMContentLoaded", function () {
    const raceSelector = document.getElementById("race");
    const ingredientsList = document.getElementById("ingredients-list");
    const coordinatesTextarea = document.getElementById("coordinatesTextarea");

    const ingredientsData = {
        asmodians: [
        {
            level: 25,
            region: 'Альтгард',
            name: 'маленькие частицы эфира',
            coords: [
                    '[pos:ур.25 маленькие частицы эфира;1 220030000 1664.756 1992.197 356 0]', '[pos:ур.25 маленькие частицы эфира;1 220030000 2620.393 1746.925 275 0]', '[pos:ур.25 маленькие частицы эфира;1 220030000 2595.757 1679.645 303 0]', '[pos:ур.25 маленькие частицы эфира;1 220030000 2489.691 1640.158 291 0]', '[pos:ур.25 маленькие частицы эфира;1 220030000 1713.458 1758.009 383 0]', '[pos:ур.25 маленькие частицы эфира;1 220030000 1802.399 1873.148 375 0]', '[pos:ур.25 маленькие частицы эфира;1 220030000 1718.735 1908.456 372 0]', '[pos:ур.25 маленькие частицы эфира;1 220030000 2717.656 1613.241 279 0]', '[pos:ур.25 маленькие частицы эфира;1 220030000 2570.881 1584.625 283 0]', '', '[pos:ур.25 маленькие частицы эфира;1 220030000 1887.037 1688.245 379 0]', '[pos:ур.25 маленькие частицы эфира;1 220030000 1555.889 1814.163 360 0]', '[pos:ур.25 маленькие частицы эфира;1 220030000 1712.708 1652.952 348 0]', '[pos:ур.25 маленькие частицы эфира;1 220030000 2545.716 1707.466 306 0]', '[pos:ур.25 маленькие частицы эфира;1 220030000 1889.673 1860.571 352 0]', '[pos:ур.25 маленькие частицы эфира;1 220030000 2664.256 1801.236 299 0]', '[pos:ур.25 маленькие частицы эфира;1 220030000 2564.925 1791.55 295 0]', '[pos:ур.25 маленькие частицы эфира;1 220030000 2587.958 1509.852 287 0]', '[pos:ур.25 маленькие частицы эфира;1 220030000 1441.531 1714.62 363 0]', '[pos:ур.25 маленькие частицы эфира;1 220030000 1514.448 1906.126 367 0]', '[pos:ур.25 маленькие частицы эфира;1 220030000 2648.301 1550.112 310 0]'
                ]
        },
        {
            level: 50,
            region: 'Альтгард',
            name: 'маленькие частицы эфира',
            coords: [
                    '[pos:ур.50 маленькие частицы эфира;1 220030000 2622.208 1808.211 339 0]', '[pos:ур.50 маленькие частицы эфира;1 220030000 1787.333 1754.877 411 0]', '[pos:ур.50 маленькие частицы эфира;1 220030000 2485.748 1784.505 343 0]', '[pos:ур.50 маленькие частицы эфира;1 220030000 2765.411 1634.031 318 0]', '[pos:ур.50 маленькие частицы эфира;1 220030000 1591.152 1818.94 394 0]', '[pos:ур.50 маленькие частицы эфира;1 220030000 1449.479 1916.006 407 0]', '[pos:ур.50 маленькие частицы эфира;1 220030000 2485.336 1576.682 352 0]', '[pos:ур.50 маленькие частицы эфира;1 220030000 2630.048 1706.966 331 0]', '[pos:ур.50 маленькие частицы эфира;1 220030000 1549.84 1705.993 402 0]', '[pos:ур.50 маленькие частицы эфира;1 220030000 2439.245 1633.885 347 0]', '[pos:ур.50 маленькие частицы эфира;1 220030000 2592.938 1574.048 327 0]', '[pos:ур.50 маленькие частицы эфира;1 220030000 2693.113 1697.421 335 0]', '[pos:ур.50 маленькие частицы эфира;1 220030000 1563.569 1911.732 423 0]', '[pos:ур.50 маленькие частицы эфира;1 220030000 1701.637 1617.467 390 0]', '[pos:ур.50 маленькие частицы эфира;1 220030000 2623.55 1609.934 315 0]', '[pos:ур.50 маленькие частицы эфира;1 220030000 2712.242 1532.581 322 0]', '[pos:ур.50 маленькие частицы эфира;1 220030000 1706.545 1834.248 387 0]', '[pos:ур.50 маленькие частицы эфира;1 220030000 1620.398 2008.497 398 0]', '[pos:ур.50 маленькие частицы эфира;1 220030000 1825.58 1690.958 415 0]', '[pos:ур.50 маленькие частицы эфира;1 220030000 1743.847 1606.604 419 0]'
                ]
        },
        {
            level: 75,
            region: 'Альтгард',
            name: 'маленькие частицы эфира',
            coords: [
                    '[pos:ур.75 маленькие частицы эфира;1 220030000 2666.937 1749.975 387 0]', '[pos:ур.75 маленькие частицы эфира;1 220030000 2706.932 1572.397 380 0]', '[pos:ур.75 маленькие частицы эфира;1 220030000 2533.913 1636.761 360 0]', '[pos:ур.75 маленькие частицы эфира;1 220030000 2659.764 1846.868 372 0]', '[pos:ур.75 маленькие частицы эфира;1 220030000 2534.98 1535.974 363 0]', '[pos:ур.75 маленькие частицы эфира;1 220030000 2571.508 1753.69 355 0]', '[pos:ур.75 маленькие частицы эфира;1 220030000 2473.196 1692.284 391 0]', '[pos:ур.75 маленькие частицы эфира;1 220030000 2634.941 1482.276 376 0]', '[pos:ур.75 маленькие частицы эфира;1 220030000 2618.41 1563.332 383 0]', '[pos:ур.75 маленькие частицы эфира;1 220030000 2445.924 1721.017 367 0]'
                ]
        },
		{
            level: 100,
            region: 'Альтгард',
            name: 'большая частица эфира',
            coords: [
                    '[pos:ур.100 большая частица эфира;1 220030000 2506.18 1715.38 429 0]', '[pos:ур.100 большая частица эфира;1 220030000 2523.46 1773.79 399 0]', '[pos:ур.100 большая частица эфира;1 220030000 2531.64 1835.37 410 0]', '[pos:ур.100 большая частица эфира;1 220030000 2573.2000 1622.01 425 0]', '[pos:ур.100 большая частица эфира;1 220030000 2581.2000 1715.86 407 0]', '[pos:ур.100 большая частица эфира;1 220030000 2646.71 1681.66 395 0]', '[pos:ур.100 большая частица эфира;1 220030000 2714.8000 1768.98 403 0]', '[pos:ур.100 большая частица эфира;1 220030000 2737.5000 1696.32 422 0]', '[pos:ур.100 большая частица эфира;1 220030000 2774.51 1573.82 413 0]', '[pos:ур.100 большая частица эфира;1 220030000 2531.641 1835.368 413 0]', '[pos:ур.100 большая частица эфира;1 220030000 2573.195 1622.005 399 0]', '[pos:ур.100 большая частица эфира;1 220030000 2506.183 1715.382 410 0]', '[pos:ур.100 большая частица эфира;1 220030000 2714.804 1768.984 425 0]', '[pos:ур.100 большая частица эфира;1 220030000 2523.464 1773.793 407 0]', '[pos:ур.100 большая частица эфира;1 220030000 2581.202 1715.86 395 0]', '[pos:ур.100 большая частица эфира;1 220030000 2646.705 1681.662 403 0]', '[pos:ур.100 большая частица эфира;1 220030000 2737.048 1696.321 422 0]', '[pos:ур.100 большая частица эфира;1 220030000 2498.914 1526.741 413 0]', '[pos:ур.100 большая частица эфира;1 220030000 2774.515 1573.82 413 0]'
                ]
        },
		{
            level: 75,
            region: 'Морхейм',
            name: 'маленькие частицы эфира',
           coords: [
                    '[pos:ур.75 маленькие частицы эфира;1 220020000 421.8388 2447.229 473 0]', '[pos:ур.75 маленькие частицы эфира;1 220020000 236.6647 2467.913 464 0]', '[pos:ур.75 маленькие частицы эфира;1 220020000 300.7807 2328.461 470 0]', '[pos:ур.75 маленькие частицы эфира;1 220020000 366.2337 2272.818 462 0]', '[pos:ур.75 маленькие частицы эфира;1 220020000 336.9283 2483.304 463 0]', '[pos:ур.75 маленькие частицы эфира;1 220020000 401.6289 2336.114 460 0]', '[pos:ур.75 маленькие частицы эфира;1 220020000 330.1136 2219.878 471 0]', '[pos:ур.75 маленькие частицы эфира;1 220020000 241.8109 2393.294 469 0]', '[pos:ур.75 маленькие частицы эфира;1 220020000 168.736 2373.738 466 0]', '[pos:ур.75 маленькие частицы эфира;1 220020000 246.4424 2252.29 467 0]'
                ]
        },
		{
            level: 100,
            region: 'Морхейм',
            name: 'большая частица эфира',
            coords: [
                    '[pos:ур.100 большая частица эфира;1 220020000 317.3389 2265.999 482 0]', '[pos:ур.100 большая частица эфира;1 220020000 413.2474 2263.462 484 0]', '[pos:ур.100 большая частица эфира;1 220020000 206.2069 2464.413 485 0]', '[pos:ур.100 большая частица эфира;1 220020000 208.1667 2285.024 489 0]', '[pos:ур.100 большая частица эфира;1 220020000 345.27 2370.25 478 0]', '[pos:ур.100 большая частица эфира;1 220020000 292.4738 2472.025 480 0]', '[pos:ур.100 большая частица эфира;1 220020000 248.0249 2339.63 494 0]', '[pos:ур.100 большая частица эфира;1 220020000 303.5374 2448.383 490 0]', '[pos:ур.100 большая частица эфира;1 220020000 433.1006 2399.591 492 0]', '[pos:ур.100 большая частица эфира;1 220020000 182.6716 2329.877 487 0]', '[pos:ур.100 большая частица эфира;1 220020000 208.5823 2381.598 508 0]', '[pos:ур.100 большая частица эфира;1 220020000 338.8132 2427.883 503 0]', '[pos:ур.100 большая частица эфира;1 220020000 274.931 2299.56 498 0]', '[pos:ур.100 большая частица эфира;1 220020000 286.0552 2228.696 500 0]', '[pos:ур.100 большая частица эфира;1 220020000 436.3443 2337.813 501 0]', '[pos:ур.100 большая частица эфира;1 220020000 184.5993 2447.685 507 0]', '[pos:ур.100 большая частица эфира;1 220020000 268.2304 2397.37 496 0]', '[pos:ур.100 большая частица эфира;1 220020000 259.1677 2453.322 509 0]', '[pos:ур.100 большая частица эфира;1 220020000 389.9771 2473.717 505 0]', '[pos:ур.100 большая частица эфира;1 220020000 290.9326 2385.856 510 0]'
                ]
        },
		{
            level: 125,
            region: 'Морхейм',
            name: 'большая частица эфира',
           coords: [
                    '[pos:ур.125 большая частица эфира;1 220020000 326.1273 2512.75 518 0]', '[pos:ур.125 большая частица эфира;1 220020000 418.4023 2370.91 521 0]', '[pos:ур.125 большая частица эфира;1 220020000 312.9451 2270.199 515 0]', '[pos:ур.125 большая частица эфира;1 220020000 313.4442 2416.066 511 0]', '[pos:ур.125 большая частица эфира;1 220020000 379.3832 2376.183 513 0]', '[pos:ур.125 большая частица эфира;1 220020000 356.1826 2345.601 520 0]', '[pos:ур.125 большая частица эфира;1 220020000 205.6758 2501.173 526 0]', '[pos:ур.125 большая частица эфира;1 220020000 366.201 2235.398 522 0]', '[pos:ур.125 большая частица эфира;1 220020000 157.1654 2311.35 524 0]', '[pos:ур.125 большая частица эфира;1 220020000 186.3965 2414.675 516 0]'
                ]
        },
		{
            level: 150,
            region: 'Морхейм',
            name: 'большая частица эфира',
           coords: [
                    '[pos:ур.150 большая частица эфира;1 220020000 171.2386 2291.128 535 0]', '[pos:ур.150 большая частица эфира;1 220020000 283.6443 2516.563 531 0]', '[pos:ур.150 большая частица эфира;1 220020000 227.1758 2430.796 533 0]', '[pos:ур.150 большая частица эфира;1 220020000 336.4614 2252.545 539 0]', '[pos:ур.150 большая частица эфира;1 220020000 380.3354 2418.886 530 0]', '[pos:ур.150 большая частица эфира;1 220020000 401.1515 2299.937 529 0]', '[pos:ур.150 большая частица эфира;1 220020000 261.8693 2296.373 537 0]', '[pos:ур.150 большая частица эфира;1 220020000 196.0766 2364.073 534 0]', '[pos:ур.150 большая частица эфира;1 220020000 362.6953 2466.483 543 0]'
                ]
        },
		{
            level: 175,
            region: 'Морхейм',
            name: 'большая частица эфира',
            coords: [
                    '[pos:ур.175 большая частица эфира;1 220020000 273.8578 2372.625 553 0]', '[pos:ур.175 большая частица эфира;1 220020000 1574.631 1183.695 77 0]', '[pos:ур.175 большая частица эфира;1 220020000 151.8216 2401.61 557 0]', '[pos:ур.175 большая частица эфира;1 220020000 1813.496 1114.016 57 0]', '[pos:ур.175 большая частица эфира;1 220020000 1817.683 1425.935 62 0]', '[pos:ур.175 большая частица эфира;1 220020000 365.7916 2437.137 547 0]', '[pos:ур.175 большая частица эфира;1 220020000 212.4584 2248.843 554 0]', '[pos:ур.175 большая частица эфира;1 220020000 1876.996 1249.391 59 0]', '[pos:ур.175 большая частица эфира;1 220020000 1668.854 1159.693 64 0]', '[pos:ур.175 большая частица эфира;1 220020000 1719.027 1438.53 72 0]', '[pos:ур.175 большая частица эфира;1 220020000 226.56 2409.131 559 0]', '[pos:ур.175 большая частица эфира;1 220020000 238.7813 2315.121 555 0]', '[pos:ур.175 большая частица эфира;1 220020000 278.9415 2487.189 563 0]', '[pos:ур.175 большая частица эфира;1 220020000 331.6628 2323.678 549 0]', '[pos:ур.175 большая частица эфира;1 220020000 1747.59 1246.2 54 0]', '[pos:ур.175 большая частица эфира;1 220020000 1650.848 1157.547 52 0]', '[pos:ур.175 большая частица эфира;1 220020000 215.2787 2487.63 561 0]', '[pos:ур.175 большая частица эфира;1 220020000 1557.187 1370.06 69 0]', '[pos:ур.175 большая частица эфира;1 220020000 389.4907 2358.994 551 0]', '[pos:ур.175 большая частица эфира;1 220020000 1540.413 1253.087 75 0]'
                ]
        },
		{
            level: 200,
            region: 'Морхейм',
            name: 'сгусток эфира',
            coords: [
                    '[pos:ур.200 сгусток эфира;1 220020000 1766.065 1450.082 101 0]', '[pos:ур.200 сгусток эфира;1 220020000 1824.33 1309.974 89 0]', '[pos:ур.200 сгусток эфира;1 220020000 1681.062 1220.085 95 0]', '[pos:ур.200 сгусток эфира;1 220020000 1682.807 1149.766 83 0]', '[pos:ур.200 сгусток эфира;1 220020000 1747.951 1334.992 98 0]', '[pos:ур.200 сгусток эфира;1 220020000 1697.234 1274.376 79 0]', '[pos:ур.200 сгусток эфира;1 220020000 1757.932 1137.838 81 0]', '[pos:ур.200 сгусток эфира;1 220020000 1636.467 1437.418 85 0]', '[pos:ур.200 сгусток эфира;1 220020000 1608.582 1108.47 87 0]', '[pos:ур.200 сгусток эфира;1 220020000 1572.53 1311.63 92 0]'
                ]
        },
		{
            level: 225,
            region: 'Морхейм',
            name: 'сгусток эфира',
            coords: [
                    '[pos:ур.225 сгусток эфира;1 220020000 1647.177 1351.47 128 0]', '[pos:ур.225 сгусток эфира;1 220020000 1584.377 1071.305 125 0]', '[pos:ур.225 сгусток эфира;1 220020000 1613.878 1176.58 122 0]', '[pos:ур.225 сгусток эфира;1 220020000 1636.064 1302.709 120 0]', '[pos:ур.225 сгусток эфира;1 220020000 1717.371 1210.542 110 0]', '[pos:ур.225 сгусток эфира;1 220020000 1708.032 1317.868 118 0]', '[pos:ур.225 сгусток эфира;1 220020000 1771.452 1270.347 116 0]', '[pos:ур.225 сгусток эфира;1 220020000 1639.948 1399.564 113 0]', '[pos:ур.225 сгусток эфира;1 220020000 1757.191 1407.402 106 0]', '[pos:ур.225 сгусток эфира;1 220020000 1834.654 1243.029 108 0]'
                ]
        },
		{
            level: 250,
            region: 'Морхейм',
            name: 'сгусток эфира',
            coords: [
                    '[pos:ур.250 сгусток эфира;1 220020000 1679.455 1346.228 155 0]', '[pos:ур.250 сгусток эфира;1 220020000 1679.308 1425.719 150 0]', '[pos:ур.250 сгусток эфира;1 220020000 1615.387 1312.124 136 0]', '[pos:ур.250 сгусток эфира;1 220020000 1864.088 1153.975 145 0]', '[pos:ур.250 сгусток эфира;1 220020000 1626.09 1218.499 152 0]', '[pos:ур.250 сгусток эфира;1 220020000 1676.824 1100.498 139 0]', '[pos:ур.250 сгусток эфира;1 220020000 1851.368 1349.797 148 0]', '[pos:ур.250 сгусток эфира;1 220020000 1631.631 1031.313 143 0]', '[pos:ур.250 сгусток эфира;1 220020000 1787.193 1088.791 141 0]', '[pos:ур.250 сгусток эфира;1 220020000 1651.826 1280.733 133 0]'
                ]
        },
		{
            level: 275,
            region: 'Морхейм',
            name: 'сгусток эфира',
            coords: [
                    '[pos:ур.275 сгусток эфира;1 220020000 1720.017 1142.558 164 0]', '[pos:ур.275 сгусток эфира;1 220020000 1808.544 1183.061 162 0]', '[pos:ур.275 сгусток эфира;1 220020000 1612.756 1370.316 184 0]', '[pos:ур.275 сгусток эфира;1 220020000 1616.475 1292.444 181 0]', '[pos:ур.275 сгусток эфира;1 220020000 1582.046 1430.449 170 0]', '[pos:ур.275 сгусток эфира;1 220020000 1857.923 1400.517 175 0]', '[pos:ур.275 сгусток эфира;1 220020000 1796.397 1239.181 160 0]', '[pos:ур.275 сгусток эфира;1 220020000 1778.299 1365.597 172 0]', '[pos:ур.275 сгусток эфира;1 220020000 1705.128 1240.539 178 0]', '[pos:ур.275 сгусток эфира;1 220020000 1577.137 1035.401 167 0]'
                ]
        },
		{
            level: 300,
            region: 'Морхейм',
            name: 'пылающий эфир',
            coords: [
                    '[pos:ур.300 пылающий эфир;1 220020000 1558.791 1122.811 208 0]', '[pos:ур.300 пылающий эфир;1 220020000 1712.914 1076.482 192 0]', '[pos:ур.300 пылающий эфир;1 220020000 1608.506 1470.39 205 0]', '[pos:ур.300 пылающий эфир;1 220020000 1631.638 1128.539 210 0]', '[pos:ур.300 пылающий эфир;1 220020000 1811.038 1389.241 202 0]', '[pos:ур.300 пылающий эфир;1 220020000 1890.971 1212.004 198 0]', '[pos:ур.300 пылающий эфир;1 220020000 1767.042 1320.439 200 0]', '[pos:ур.300 пылающий эфир;1 220020000 1620.182 1346.241 187 0]', '[pos:ур.300 пылающий эфир;1 220020000 1589.354 1254.03 190 0]', '[pos:ур.300 пылающий эфир;1 220020000 1775.284 1048.447 195 0]'
                ]
        },
		{
        level: 175,
        region: 'Белуслан',
        name: 'большая частица эфира',
        coords: [
                    '[pos:ур.175 большая частица эфира;1 220040000 434.7094 592.3013 274 0]', '[pos:ур.175 большая частица эфира;1 220040000 414.1117 466.1402 276 0]', '[pos:ур.175 большая частица эфира;1 220040000 304.9951 143.3333 265 0]', '[pos:ур.175 большая частица эфира;1 220040000 484.1801 491.9024 271 0]', '[pos:ур.175 большая частица эфира;1 220040000 154.5548 227.6621 281 0]', '[pos:ур.175 большая частица эфира;1 220040000 513.6054 371.9943 268 0]', '[pos:ур.175 большая частица эфира;1 220040000 469.9738 158.6166 266 0]', '[pos:ур.175 большая частица эфира;1 220040000 282.4984 557.8346 277 0]', '[pos:ур.175 большая частица эфира;1 220040000 365.14 533.54 260 0]', '[pos:ур.175 большая частица эфира;1 220040000 163.349 409.0207 262 0]'
                ]
    },
	{
        level: 200,
        region: 'Белуслан',
        name: 'сгусток эфира',
        coords: [
                    '[pos:ур.200 сгусток эфира;1 220040000 222.5182 380.4965 306 0]', '[pos:ур.200 сгусток эфира;1 220040000 422.3253 152.0624 295 0]', '[pos:ур.200 сгусток эфира;1 220040000 562.6031 442.6407 293 0]', '[pos:ур.200 сгусток эфира;1 220040000 398.0682 561.6168 283 0]', '[pos:ур.200 сгусток эфира;1 220040000 371.2138 108.22 298 0]', '[pos:ур.200 сгусток эфира;1 220040000 368.5125 465.5499 286 0]', '[pos:ур.200 сгусток эфира;1 220040000 115.4437 349.4639 302 0]', '[pos:ур.200 сгусток эфира;1 220040000 234.6187 531.7323 310 0]', '[pos:ур.200 сгусток эфира;1 220040000 242.5627 178.4157 300 0]', '[pos:ур.200 сгусток эфира;1 220040000 526.9442 310.2144 289 0]', '[pos:ур.200 сгусток эфира;1 220040000 234.7406 233.231 318 0]', '[pos:ур.200 сгусток эфира;1 220040000 330.1573 199.8063 322 0]', '[pos:ур.200 сгусток эфира;1 220040000 463.957 547.7992 333 0]', '[pos:ур.200 сгусток эфира;1 220040000 344.6733 604.4274 337 0]', '[pos:ур.200 сгусток эфира;1 220040000 214.7604 494.4102 313 0]', '[pos:ур.200 сгусток эфира;1 220040000 302.1841 478.0589 339 0]', '[pos:ур.200 сгусток эфира;1 220040000 476.8011 211.3191 326 0]', '[pos:ур.200 сгусток эфира;1 220040000 465.4518 290.2437 328 0]', '[pos:ур.200 сгусток эфира;1 220040000 171.5502 345.2862 315 0]', '[pos:ур.200 сгусток эфира;1 220040000 556.0433 394.0958 331 0]'
                ]
    },
	{
        level: 225,
        region: 'Белуслан',
        name: 'сгусток эфира',
        coords: [
                    '[pos:ур.225 сгусток эфира;1 220040000 222.2797 429.9565 347 0]', '[pos:ур.225 сгусток эфира;1 220040000 387.4255 381.0545 362 0]', '[pos:ур.225 сгусток эфира;1 220040000 490.3312 434.0721 360 0]', '[pos:ур.225 сгусток эфира;1 220040000 181.3228 186.3175 352 0]', '[pos:ур.225 сгусток эфира;1 220040000 292.5473 606.9057 343 0]', '[pos:ур.225 сгусток эфира;1 220040000 302.23 538.65 341 0]', '[pos:ур.225 сгусток эфира;1 220040000 266.1064 350.7582 395 0]', '[pos:ур.225 сгусток эфира;1 220040000 176.3329 289.523 349 0]', '[pos:ур.225 сгусток эфира;1 220040000 406.785 237.6993 359 0]', '[pos:ур.225 сгусток эфира;1 220040000 440.13 107.29 355 0]'
                ]
    },
	{
        level: 250,
        region: 'Белуслан',
        name: 'сгусток эфира',
        coords: [
                    '[pos:ур.250 сгусток эфира;1 220040000 295.6752 442.7476 395 0]', '[pos:ур.250 сгусток эфира;1 220040000 537.069 469.0772 389 0]', '[pos:ур.250 сгусток эфира;1 220040000 427.4849 533.144 368 0]', '[pos:ур.250 сгусток эфира;1 220040000 298.4058 220.5501 379 0]', '[pos:ур.250 сгусток эфира;1 220040000 379.5341 327.249 392 0]', '[pos:ур.250 сгусток эфира;1 220040000 132.6308 283.9261 374 0]', '[pos:ур.250 сгусток эфира;1 220040000 497.0177 151.0091 380 0]', '[pos:ур.250 сгусток эфира;1 220040000 154.5991 460.6924 372 0]', '[pos:ур.250 сгусток эфира;1 220040000 318.286 301.625 383 0]', '[pos:ур.250 сгусток эфира;1 220040000 447.8967 420.7418 368 0]'
                ]
    },
	{
        level: 275,
        region: 'Белуслан',
        name: 'сгусток эфира',
       coords: [
                    '[pos:ур.275 сгусток эфира;1 220040000 379.6429 508.9421 400 0]', '[pos:ур.275 сгусток эфира;1 220040000 527.7148 515.4073 413 0]', '[pos:ур.275 сгусток эфира;1 220040000 647.4968 2803.668 199 0]', '[pos:ур.275 сгусток эфира;1 220040000 277.5557 295.8771 407 0]', '[pos:ур.275 сгусток эфира;1 220040000 263.0622 465.9687 416 0]', '[pos:ур.275 сгусток эфира;1 220040000 518.8898 2814.009 227 0]', '[pos:ур.275 сгусток эфира;1 220040000 390.3592 275.6504 418 0]', '[pos:ур.275 сгусток эфира;1 220040000 590.3247 2912.247 223 0]', '[pos:ур.275 сгусток эфира;1 220040000 620.07 2742.38 190 0]', '[pos:ур.275 сгусток эфира;1 220040000 685.0964 2934.129 217 0]', '[pos:ур.275 сгусток эфира;1 220040000 740.4152 2983.006 211 0]', '[pos:ур.275 сгусток эфира;1 220040000 634.1675 2644.845 194 0]', '[pos:ур.275 сгусток эфира;1 220040000 297.5796 346.7829 411 0]', '[pos:ур.275 сгусток эфира;1 220040000 393.8161 136.1492 403 0]', '[pos:ур.275 сгусток эфира;1 220040000 806.4719 2730.881 205 0]', '[pos:ур.275 сгусток эфира;1 220040000 281.03 533.25 399 0]', '[pos:ур.275 сгусток эфира;1 220040000 138.4859 390.3295 410 0]', '[pos:ур.275 сгусток эфира;1 220040000 355.9498 232.6713 406 0]'
                ]
    },
	{
        level: 300,
        region: 'Белуслан',
        name: 'пылающий эфир',
        coords: [
                    '[pos:ур.300 пылающий эфир;1 220040000 575.73 2771.66 255 0]', '[pos:ур.300 пылающий эфир;1 220040000 740.02 2733.88 269 0]', '[pos:ур.300 пылающий эфир;1 220040000 741.74 2867.08 265 0]', '[pos:ур.300 пылающий эфир;1 220040000 609.68 2838.69 259 0]', '[pos:ур.300 пылающий эфир;1 220040000 645.1 2705.01 251 0]', '[pos:ур.300 пылающий эфир;1 220040000 546.16 2787.29 231 0]', '[pos:ур.300 пылающий эфир;1 220040000 719.96 2827.27 237 0]', '[pos:ур.300 пылающий эфир;1 220040000 695.13 2640.99 240 0]', '[pos:ур.300 пылающий эфир;1 220040000 789.92 2854.47 243 0]', '[pos:ур.300 пылающий эфир;1 220040000 705.6 2984.77 248 0]', '[pos:ур.300 пылающий эфир;1 220040000 610.45 2789.16 233 0]', '[pos:ур.300 пылающий эфир;1 220040000 697.63 2806.74 263 0]', '[pos:ур.300 пылающий эфир;1 220040000 736.7823 2791.742 305 0]', '[pos:ур.300 пылающий эфир;1 220040000 791.348 2751.47 279 0]', '[pos:ур.300 пылающий эфир;1 220040000 688.5854 2732.305 296 0]', '[pos:ур.300 пылающий эфир;1 220040000 580.3843 2805.166 286 0]', '[pos:ур.300 пылающий эфир;1 220040000 797.7405 2807.764 275 0]', '[pos:ур.300 пылающий эфир;1 220040000 623.2794 2683.194 289 0]', '[pos:ур.300 пылающий эфир;1 220040000 659.6451 2903.29 282 0]', '[pos:ур.300 пылающий эфир;1 220040000 789.7853 2678.125 300 0]', '[pos:ур.300 пылающий эфир;1 220040000 754.4882 2839.166 272 0]', '[pos:ур.300 пылающий эфир;1 220040000 899.4193 2702.853 303 0]', '[pos:ур.300 пылающий эфир;1 220040000 549.1763 2758.593 293 0]', '[pos:ур.300 пылающий эфир;1 220040000 573.3376 2719.868 308 0]'
                ]
    },
	{
        level: 325,
        region: 'Белуслан',
        name: 'пылающий эфир',
        coords: [
                    '[pos:ур.325 пылающий эфир;1 220040000 655.1198 2858.709 317 0]', '[pos:ур.325 пылающий эфир;1 220040000 687.956 2797.657 313 0]', '[pos:ур.325 пылающий эфир;1 220040000 873.8172 2596.089 338 0]', '[pos:ур.325 пылающий эфир;1 220040000 933.0949 2714.047 335 0]', '[pos:ур.325 пылающий эфир;1 220040000 718.2415 2933.337 323 0]', '[pos:ур.325 пылающий эфир;1 220040000 859.0974 2777.221 332 0]', '[pos:ур.325 пылающий эфир;1 220040000 559.6893 2818.008 346 0]', '[pos:ур.325 пылающий эфир;1 220040000 771.8294 2825.548 325 0]', '[pos:ур.325 пылающий эфир;1 220040000 572.753 2845.442 349 0]', '[pos:ур.325 пылающий эфир;1 220040000 675.3071 2631.717 342 0]', '[pos:ур.325 пылающий эфир;1 220040000 622.7178 3004.675 319 0]', '[pos:ур.325 пылающий эфир;1 220040000 803.7298 2707.742 329 0]'
                ]
    },
    {
        level: 350,
        region: 'Белуслан',
        name: 'пылающий эфир',
        coords: [
                    '[pos:ур.350 пылающий эфир;1 220040000 848.8802 2647.023 370 0]', '[pos:ур.350 пылающий эфир;1 220040000 519.3994 2740.887 379 0]', '[pos:ур.350 пылающий эфир;1 220040000 713.9027 2885.512 354 0]', '[pos:ур.350 пылающий эфир;1 220040000 489.3691 2848.964 384 0]', '[pos:ур.350 пылающий эфир;1 220040000 598.5475 2767.383 375 0]', '[pos:ур.350 пылающий эфир;1 220040000 830.9025 2860.316 364 0]', '[pos:ур.350 пылающий эфир;1 220040000 701.858 2865.073 393 0]', '[pos:ур.350 пылающий эфир;1 220040000 825.1226 2725.68 367 0]', '[pos:ур.350 пылающий эфир;1 220040000 650.0816 2905.099 357 0]', '[pos:ур.350 пылающий эфир;1 220040000 732.1691 2659.996 372 0]', '[pos:ур.350 пылающий эфир;1 220040000 751.6649 2913.197 361 0]', '[pos:ур.350 пылающий эфир;1 220040000 660.0518 2831.123 389 0]'
                ]
    },
    {
        level: 375,
        region: 'Белуслан',
        name: 'пылающий эфир',
        coords: [
                    '[pos:ур.375 пылающий эфир;1 220040000 701.4807 2596.927 409 0]', '[pos:ур.375 пылающий эфир;1 220040000 820.287 2790.445 420 0]', '[pos:ур.375 пылающий эфир;1 220040000 577.5995 2794.585 431 0]', '[pos:ур.375 пылающий эфир;1 220040000 607.0995 2920.936 429 0]', '[pos:ур.375 пылающий эфир;1 220040000 713.4818 2803.509 395 0]', '[pos:ур.375 пылающий эфир;1 220040000 793.9374 2634.263 412 0]', '[pos:ур.375 пылающий эфир;1 220040000 599.2161 2709.53 402 0]', '[pos:ур.375 пылающий эфир;1 220040000 908.9175 2655.822 417 0]', '[pos:ур.375 пылающий эфир;1 220040000 632.5984 2878.079 399 0]', '[pos:ур.375 пылающий эфир;1 220040000 670.4342 2980.481 425 0]', '[pos:ур.375 пылающий эфир;1 220040000 616.9423 2607.006 406 0]', '[pos:ур.375 пылающий эфир;1 220040000 804.476 2936.999 422 0]'
                ]
    },
    {
        level: 375,
        region: 'Келькмарос',
        name: 'пылающий эфир',
        coords: [
                    '[pos:ур.375 пыл.эфир;1 220070000 1305.8907 2385.1548 334.50775 0]', '[pos:ур.375 пыл.эфир;1 220070000 1121.2993 2372.8745 195.29979 0]', '[pos:ур.375 пыл.эфир;1 220070000 1076.7194 2420.3347 341.65234 0]', '[pos:ур.375 пыл.эфир;1 220070000 1071.3621 2495.1575 188.72054 0]', '[pos:ур.375 пыл.эфир;1 220070000 1258.8993 2529.6047 335.19058 0]', '[pos:ур.375 пыл.эфир;1 220070000 1304.8063 2475.8794 188.72054 0]', '[pos:ур.375 пыл.эфир;1 220070000 1189.5693 2343.8047 330 0]', '[pos:ур.375 пыл.эфир;1 220070000 1105.4293 2546.1545 332.16309 0]', '[pos:ур.375 пыл.эфир;1 220070000 1258.3793 2318.9146 196.45023 0]', '[pos:ур.375 пыл.эфир;1 220070000 1236.3506 2547.0327 195.45834 0]'
                ]
    },
    {
        level: 400,
        region: 'Келькмарос',
        name: 'магический эфир',
        coords: [
                    '[pos:ур.400 маг.эфир;1 220070000 1072.7124 1520.5494 96.179932 0]', '[pos:ур.400 маг.эфир;1 220070000 1124.6514 1600.8926 96.179932 0]', '[pos:ур.400 маг.эфир;1 220070000 1261.7062 2440.926 213.82014 0]', '[pos:ур.400 маг.эфир;1 220070000 1230.2288 2060.374 297.11502 0]', '[pos:ур.400 маг.эфир;1 220070000 1230.2162 2413.2961 315.01633 0]', '[pos:ур.400 маг.эфир;1 220070000 976.94836 1337.7986 188.17993 0]', '[pos:ур.400 маг.эфир;1 220070000 1019.3593 2245.4175 165.98555 0]', '[pos:ур.400 маг.эфир;1 220070000 979.47198 1420.5515 96.179932 0]', '[pos:ур.400 маг.эфир;1 220070000 1089.9399 1561.558 106.61162 0]', '[pos:ур.400 маг.эфир;1 220070000 1236.0461 2344.376 310 0]', '[pos:ур.400 маг.эфир;1 220070000 1073.6509 1564.014 196.17993 0]', '[pos:ур.400 маг.эфир;1 220070000 1137.1761 2392.8362 301.27328 0]', '[pos:ур.400 маг.эфир;1 220070000 940.74152 1375.8237 103.17993 0]', '[pos:ур.400 маг.эфир;1 220070000 1034.97 1448.8579 99.929382 0]', '[pos:ур.400 маг.эфир;1 220070000 1157.495 2009.657 177.01553 0]', '[pos:ур.400 маг.эфир;1 220070000 1053.3098 1487.548 111.36108 0]', '[pos:ур.400 маг.эфир;1 220070000 1261.9362 2379.936 314.95422 0]', '[pos:ур.400 маг.эфир;1 220070000 964.80994 1344.7479 102.17993 0]', '[pos:ур.400 маг.эфир;1 220070000 1110.3181 1581.3044 188.17993 0]', '[pos:ур.400 маг.эфир;1 220070000 1054.1499 1534.3679 103.11638 0]', '[pos:ур.400 маг.эфир;1 220070000 1127.5161 2481.616 318.67041 0]', '[pos:ур.400 маг.эфир;1 220070000 1125.2909 2417.4365 212.32611 0]', '[pos:ур.400 маг.эфир;1 220070000 1248.6661 2490.3562 314.78433 0]', '[pos:ур.400 маг.эфир;1 220070000 976.78558 2263.7346 296.42865 0]', '[pos:ур.400 маг.эфир;1 220070000 1144.563 1604.9736 196.17993 0]', '[pos:ур.400 маг.эфир;1 220070000 1195.8293 2150.165 168.7774 0]', '[pos:ур.400 маг.эфир;1 220070000 999.04321 2249.9063 308.0325 0]', '[pos:ур.400 маг.эфир;1 220070000 1196.6561 2331.636 207.75557 0]', '[pos:ур.400 маг.эфир;1 220070000 1174.4148 2109.2488 306.77417 0]', '[pos:ур.400 маг.эфир;1 220070000 1087.8231 2159.2373 174.42599 0]', '[pos:ур.400 маг.эфир;1 220070000 1184.2861 2430.0662 310 0]', '[pos:ур.400 маг.эфир;1 220070000 1215.2411 2110.28 171.07578 0]', '[pos:ур.400 маг.эфир;1 220070000 1164.5961 2347.386 310 0]', '[pos:ур.400 маг.эфир;1 220070000 1172.5862 2466.926 210 0]', '[pos:ур.400 маг.эфир;1 220070000 1052.7031 2202.1831 296.42865 0]', '[pos:ур.400 маг.эфир;1 220070000 1033.074 1489.8658 196.17993 0]', '[pos:ур.400 маг.эфир;1 220070000 1034.3618 1422.8939 188.17993 0]', '[pos:ур.400 маг.эфир;1 220070000 1225.3561 2476.0862 305.70532 0]', '[pos:ур.400 маг.эфир;1 220070000 1285.2062 2421.1438 212.32611 0]', '[pos:ур.400 маг.эфир;1 220070000 1176.9232 2020.4049 179.48495 0]', '[pos:ур.400 маг.эфир;1 220070000 944.98004 1361.8463 188.17993 0]', '[pos:ур.400 маг.эфир;1 220070000 1180.2043 2121.9534 175.98944 0]', '[pos:ур.400 маг.эфир;1 220070000 1240.0662 2375.646 210 0]', '[pos:ур.400 маг.эфир;1 220070000 954.62994 1394.168 196.17993 0]', '[pos:ур.400 маг.эфир;1 220070000 1068.5535 2179.2498 305.63022 0]', '[pos:ур.400 маг.эфир;1 220070000 1028.0857 2233.2078 292.65366 0]', '[pos:ур.400 маг.эфир;1 220070000 1038.5516 2217.4241 175.98944 0]', '[pos:ур.400 маг.эфир;1 220070000 1107.0562 2409.0962 308.36856 0]', '[pos:ур.400 маг.эфир;1 220070000 1195.4562 2395.916 215.67802 0]', '[pos:ур.400 маг.эфир;1 220070000 1211.0106 2052.3999 173.05078 0]', '[pos:ур.400 маг.эфир;1 220070000 1191.0632 2036.4017 184.21663 0]', '[pos:ур.400 маг.эфир;1 220070000 1079.6426 2167.0378 293.6832 0]', '[pos:ур.400 маг.эфир;1 220070000 1091.4961 2498.6062 310 0]', '[pos:ур.400 маг.эфир;1 220070000 1205.3394 2065.9841 180.99867 0]', '[pos:ур.400 маг.эфир;1 220070000 1058.8634 2187.5313 165.98555 0]', '[pos:ур.400 маг.эфир;1 220070000 1107.8173 2146.8201 303.57114 0]', '[pos:ур.400 маг.эфир;1 220070000 1196.5063 2101.5154 293.6832 0]', '[pos:ур.400 маг.эфир;1 220070000 1176.4373 2141.9617 296.42865 0]', '[pos:ур.400 маг.эфир;1 220070000 1162.9729 2128.532 165.98555 0]', '[pos:ур.400 маг.эфир;1 220070000 1116.2471 2133.5518 290.59457 0]', '[pos:ур.400 маг.эфир;1 220070000 993.18994 1437.178 183.17993 0]', '[pos:ур.400 маг.эфир;1 220070000 922.84991 1402.8179 92.684692 0]', '[pos:ур.400 маг.эфир;1 220070000 1055.3994 1563.0204 90.968834 0]', '[pos:ур.400 маг.эфир;1 220070000 993.07996 1373.6179 196.17993 0]', '[pos:ур.400 маг.эфир;1 220070000 1076.6578 2457.9861 210 0]', '[pos:ур.400 маг.эфир;1 220070000 1129.9672 2141.2017 179.33968 0]', '[pos:ур.400 маг.эфир;1 220070000 1226.4255 2086.0679 168.10736 0]', '[pos:ур.400 маг.эфир;1 220070000 1209.9381 2038.3414 303.57114 0]', '[pos:ур.400 маг.эфир;1 220070000 1205.3761 2501.176 212.32611 0]', '[pos:ур.400 маг.эфир;1 220070000 1139.2062 2373.2661 207.66295 0]', '[pos:ур.400 маг.эфир;1 220070000 1162.2361 2535.043 312.08334 0]', '[pos:ур.400 маг.эфир;1 220070000 1230.9041 2085.6636 303.57114 0]', '[pos:ур.400 маг.эфир;1 220070000 979.07996 1389.9979 113.17993 0]', '[pos:ур.400 маг.эфир;1 220070000 1036.1929 1508.5771 188.17993 0]', '[pos:ур.400 маг.эфир;1 220070000 1196.0663 2021.8279 186.73439 0]', '[pos:ур.400 маг.эфир;1 220070000 1012.4672 1459.4708 196.17993 0]', '[pos:ур.400 маг.эфир;1 220070000 1240.3961 2521.156 210 0]', '[pos:ур.400 маг.эфир;1 220070000 1125.6962 2527.916 215.27039 0]', '[pos:ур.400 маг.эфир;1 220070000 1013.4699 1402.8279 107.17993 0]', '[pos:ур.400 маг.эфир;1 220070000 1152.1276 2134.2756 299.5173 0]', '[pos:ур.400 маг.эфир;1 220070000 1052.999 2222.5911 303.57114 0]', '[pos:ур.400 маг.эфир;1 220070000 1283.5061 2470.7561 308.20026 0]', '[pos:ур.400 маг.эфир;1 220070000 1098.6177 2133.6924 161.29523 0]'
                ]
    },
    {
        level: 425,
        region: 'Келькмарос',
        name: 'магический эфир',
        coords: [
                    '[pos:ур.425 маг.эфир;1 220070000 1022.7441 2252.343 261.72144 0]', '[pos:ур.425 маг.эфир;1 220070000 955.99915 1347.2898 163.17996 0]', '[pos:ур.425 маг.эфир;1 220070000 1228.6161 2493.386 287.8707 0]', '[pos:ур.425 маг.эфир;1 220070000 1117.8785 2151.2319 280.42761 0]', '[pos:ур.425 маг.эфир;1 220070000 1027.4059 1502.4899 163.17996 0]', '[pos:ур.425 маг.эфир;1 220070000 1088.2849 1550.3616 159.10782 0]', '[pos:ур.425 маг.эфир;1 220070000 1092.1326 2156.439 271.72144 0]', '[pos:ур.425 маг.эфир;1 220070000 1235.6161 2093.6648 277.95471 0]', '[pos:ур.425 маг.эфир;1 220070000 1059.5673 1581.2263 161.00423 0]', '[pos:ур.425 маг.эфир;1 220070000 1009.0419 1436 159.22366 0]', '[pos:ур.425 маг.эфир;1 220070000 1159.0862 2433.436 227.40875 0]', '[pos:ур.425 маг.эфир;1 220070000 1197.9761 2440.7561 231.07947 0]', '[pos:ур.425 маг.эфир;1 220070000 1141.6661 2493.406 233.57918 0]', '[pos:ур.425 маг.эфир;1 220070000 1145.2261 2396.366 231.05183 0]', '[pos:ур.425 маг.эфир;1 220070000 1175.9761 2464.9861 297.85834 0]', '[pos:ур.425 маг.эфир;1 220070000 1122.0961 2411.396 295.99225 0]', '[pos:ур.425 маг.эфир;1 220070000 1210.1593 2054.6118 261.72144 0]', '[pos:ур.425 маг.эфир;1 220070000 939.09064 1395.063 159.95467 0]', '[pos:ур.425 маг.эфир;1 220070000 1184.4578 2044.2623 285.1521 0]', '[pos:ур.425 маг.эфир;1 220070000 1138.6202 1595.9865 163.17996 0]', '[pos:ур.425 маг.эфир;1 220070000 1166.2275 2113.488 269.79523 0]', '[pos:ур.425 маг.эфир;1 220070000 1138.972 2447.136 235.64894 0]', '[pos:ур.425 маг.эфир;1 220070000 1047.1294 1468.0227 157.65988 0]', '[pos:ур.425 маг.эфир;1 220070000 1119.5461 2474.4961 290.47769 0]', '[pos:ур.425 маг.эфир;1 220070000 1197.1416 2029.1552 275.1521 0]', '[pos:ур.425 маг.эфир;1 220070000 1206.3987 2104.6575 271.72144 0]', '[pos:ур.425 маг.эфир;1 220070000 1072.4614 2175.8208 261.72144 0]', '[pos:ур.425 маг.эфир;1 220070000 972.63928 1324.7451 155.96237 0]', '[pos:ур.425 маг.эфир;1 220070000 1221.124 2101.29 261.72144 0]', '[pos:ур.425 маг.эфир;1 220070000 991.96326 1403.9199 153.14738 0]', '[pos:ур.425 маг.эфир;1 220070000 1067.1276 1498.464 163.17996 0]', '[pos:ур.425 маг.эфир;1 220070000 1236.2361 2459.426 227.53732 0]', '[pos:ур.425 маг.эфир;1 220070000 1186.0016 2121.3008 265.02347 0]', '[pos:ур.425 маг.эфир;1 220070000 1181.7162 2497.626 234.44658 0]', '[pos:ур.425 маг.эфир;1 220070000 992.36951 2253.7896 277.5 0]', '[pos:ур.425 маг.эфир;1 220070000 1179.4955 2004.277 281.42776 0]', '[pos:ур.425 маг.эфир;1 220070000 1077.09 2208.2202 261.72144 0]', '[pos:ур.425 маг.эфир;1 220070000 1164.1761 2367.906 290.86496 0]', '[pos:ур.425 маг.эфир;1 220070000 1233.9961 2410.2761 296.65216 0]', '[pos:ур.425 маг.эфир;1 220070000 1060.3506 2202.0081 275.57379 0]', '[pos:ур.425 маг.эфир;1 220070000 916.81433 1384.5958 154.17996 0]', '[pos:ур.425 маг.эфир;1 220070000 1100.094 1589.8148 151.93623 0]', '[pos:ур.425 маг.эфир;1 220070000 1010.7505 1388.8901 164.7926 0]', '[pos:ур.425 маг.эфир;1 220070000 1140.7318 2127.8 261.72144 0]', '[pos:ур.425 маг.эфир;1 220070000 1219.6061 2377.2861 228.85881 0]', '[pos:ур.425 маг.эфир;1 220070000 1063.3701 1544.627 154.17996 0]', '[pos:ур.425 маг.эфир;1 220070000 1045.8475 2252.4802 266.94965 0]', '[pos:ур.425 маг.эфир;1 220070000 1030.2263 2228.47 271.72144 0]', '[pos:ур.425 маг.эфир;1 220070000 1091.6627 2140.718 265.16104 0]', '[pos:ур.425 маг.эфир;1 220070000 1188.3661 2387.9961 288.78217 0]'
                ]
    },
    {
        level: 450,
        region: 'Келькмарос',
        name: 'магический эфир',
        coords: [
                    '[pos:ур.450 маг.эфир;1 220070000 1182.9261 2400.646 270 0]', '[pos:ур.450 маг.эфир;1 220070000 1000.8928 1423.4739 124.17995 0]', '[pos:ур.450 маг.эфир;1 220070000 999.87683 2257.8499 205.98944 0]', '[pos:ур.450 маг.эфир;1 220070000 996.086 1382.1702 132.17995 0]', '[pos:ур.450 маг.эфир;1 220070000 1200.4064 2034.4283 201.37955 0]', '[pos:ур.450 маг.эфир;1 220070000 1185.1324 2098.1731 197.32954 0]', '[pos:ур.450 маг.эфир;1 220070000 1094.7828 2167.4648 193.19759 0]', '[pos:ур.450 маг.эфир;1 220070000 1028.8295 1411.693 139.40413 0]', '[pos:ур.450 маг.эфир;1 220070000 1104.7184 1600.582 132.17995 0]', '[pos:ур.450 маг.эфир;1 220070000 1057.5471 1477.1799 125.43729 0]', '[pos:ур.450 маг.эфир;1 220070000 1198.3162 2480.896 250 0]', '[pos:ур.450 маг.эфир;1 220070000 1191.6963 2041.8513 213.02905 0]', '[pos:ур.450 маг.эфир;1 220070000 1189.5457 2108.3403 210.12141 0]', '[pos:ур.450 маг.эфир;1 220070000 978.32941 1364.6157 126.69461 0]', '[pos:ур.450 маг.эфир;1 220070000 1046.1619 2210.1184 196.77116 0]', '[pos:ур.450 маг.эфир;1 220070000 1033.6437 1472.4354 133.8958 0]', '[pos:ур.450 маг.эфир;1 220070000 1041.6692 1503.6412 128.11594 0]', '[pos:ур.450 маг.эфир;1 220070000 1062.0941 2175.854 199.7589 0]', '[pos:ур.450 маг.эфир;1 220070000 1011.7374 2244.5427 201.64362 0]', '[pos:ур.450 маг.эфир;1 220070000 1178.5562 2436.4661 250 0]', '[pos:ур.450 маг.эфир;1 220070000 942.94495 1407.3988 123.74261 0]', '[pos:ур.450 маг.эфир;1 220070000 1075.4862 1539.3369 131.35379 0]', '[pos:ур.450 маг.эфир;1 220070000 1151.285 2010.7852 214.91412 0]', '[pos:ур.450 маг.эфир;1 220070000 1079.4509 2156.7615 210.56664 0]', '[pos:ур.450 маг.эфир;1 220070000 1120.1561 2478.0161 250 0]', '[pos:ур.450 маг.эфир;1 220070000 960.12183 1362.041 130.4641 0]', '[pos:ур.450 маг.эфир;1 220070000 1027.7317 1439.5773 123.03604 0]', '[pos:ур.450 маг.эфир;1 220070000 1078.8187 1564.1163 122.15728 0]', '[pos:ур.450 маг.эфир;1 220070000 978.99738 1409.7295 135.95193 0]', '[pos:ур.450 маг.эфир;1 220070000 1155.9261 2468.396 270 0]', '[pos:ур.450 маг.эфир;1 220070000 1129.7361 2425.0161 270 0]', '[pos:ур.450 маг.эфир;1 220070000 1224.1361 2419.6077 250 0]', '[pos:ур.450 маг.эфир;1 220070000 1110.8611 2139.5828 205.98944 0]', '[pos:ур.450 маг.эфир;1 220070000 1212.1096 2035.1522 209.1969 0]', '[pos:ур.450 маг.эфир;1 220070000 1162.0862 2503.9661 270 0]', '[pos:ур.450 маг.эфир;1 220070000 1224.838 2078.8337 193.75597 0]', '[pos:ур.450 маг.эфир;1 220070000 1057.3477 1510.9752 135.62393 0]', '[pos:ур.450 маг.эфир;1 220070000 1148.1962 2394.0962 250 0]', '[pos:ур.450 маг.эфир;1 220070000 1209.5061 2094.7441 204.90633 0]', '[pos:ур.450 маг.эфир;1 220070000 1213.4061 2451.366 270 0]', '[pos:ур.450 маг.эфир;1 220070000 1157.4321 2135.0449 199.89351 0]', '[pos:ур.450 маг.эфир;1 220070000 1185.4957 2010.5634 217.70599 0]', '[pos:ур.450 маг.эфир;1 220070000 1176.528 2023.8702 205.4725 0]', '[pos:ур.450 маг.эфир;1 220070000 1037.1941 2237.6001 213.12448 0]', '[pos:ур.450 маг.эфир;1 220070000 1064.6759 2198.8364 205.98944 0]'
                ]
    },
    {
        level: 475,
        region: 'Келькмарос',
        name: 'магический эфир',
        coords: [
                    '[pos:ур.475 маг.эфир;1 220070000 1201.4021 2113.0842 249.91809 0]', '[pos:ур.475 маг.эфир;1 220070000 1008.8994 2252.9185 232.49809 0]', '[pos:ур.475 маг.эфир;1 220070000 1219.4624 2049.5239 243.75191 0]', '[pos:ур.475 маг.эфир;1 220070000 1152.8263 2121.7671 241.52284 0]', '[pos:ур.475 маг.эфир;1 220070000 1170.17 2123.1814 223.48227 0]', '[pos:ур.475 маг.эфир;1 220070000 1208.3987 2070.7791 235.67809 0]', '[pos:ур.475 маг.эфир;1 220070000 1026.2272 2239.6987 242.23846 0]', '[pos:ур.475 маг.эфир;1 220070000 1056.6382 2213.6311 239.62437 0]', '[pos:ур.475 маг.эфир;1 220070000 1072.8379 2185.8601 244.85257 0]', '[pos:ур.475 маг.эфир;1 220070000 1194.0562 2094.3733 226.1946 0]', '[pos:ур.475 маг.эфир;1 220070000 1185.756 2136.47 236.94418 0]', '[pos:ур.475 маг.эфир;1 220070000 1221.7369 2104.908 233.33914 0]', '[pos:ур.475 маг.эфир;1 220070000 1175.1627 2105.1973 245.74597 0]', '[pos:ур.475 маг.эфир;1 220070000 1042.4269 2224.9453 228.17261 0]', '[pos:ур.475 маг.эфир;1 220070000 1239.7626 2081.9343 239.62437 0]', '[pos:ур.475 маг.эфир;1 220070000 1122.1488 2136.01 228.84265 0]', '[pos:ур.475 маг.эфир;1 220070000 1052.299 2195.1172 232.41623 0]', '[pos:ур.475 маг.эфир;1 220070000 1099.5985 2145.4883 239.62437 0]', '[pos:ур.475 маг.эфир;1 220070000 1157.0603 2019.5789 248.36942 0]', '[pos:ур.475 маг.эфир;1 220070000 1171.6913 2006.5524 252.89012 0]', '[pos:ур.475 маг.эфир;1 220070000 1187.6912 2024.5204 240.76389 0]', '[pos:ур.475 маг.эфир;1 220070000 1214.6841 2078.6138 239.62437 0]', '[pos:ур.475 маг.эфир;1 220070000 986.914 2258.7041 239.62437 0]', '[pos:ур.475 маг.эфир;1 220070000 1229.2583 2066.7229 229.62437 0]', '[pos:ур.475 маг.эфир;1 220070000 1145.5812 2144.8989 233.33914 0]', '[pos:ур.475 маг.эфир;1 220070000 1087.6954 2170.2361 226.59752 0]', '[pos:ур.475 маг.эфир;1 220070000 1131.377 2133.5796 246.70546 0]'
                ]
    },
    
    ],
    elyos: [
        {
            level: 1,
            region: 'Бертрон',
            name: 'маленькие частицы эфира',
            coords: [
                    '[pos:маленькие частицы эфира;0 210030000 1827.105 1505.446 132 0]', '[pos:маленькие частицы эфира;0 210030000 1576.295 1503.389 169 0]', '[pos:маленькие частицы эфира;0 210030000 1516.661 1487.271 139 0]', '[pos:маленькие частицы эфира;0 210030000 1723.745 1677.896 150 0]', '[pos:маленькие частицы эфира;0 210030000 1705.716 1377.761 135 0]', '[pos:маленькие частицы эфира;0 210030000 1572.636 1376.149 156 0]', '[pos:маленькие частицы эфира;0 210030000 1758.037 1638.313 150 0]', '[pos:маленькие частицы эфира;0 210030000 1688.138 1321.097 143 0]', '[pos:маленькие частицы эфира;0 210030000 1513.347 1439.427 156 0]', '[pos:маленькие частицы эфира;0 210030000 1557.746 1610.672 169 0]', '[pos:маленькие частицы эфира;0 210030000 1618.258 1650.434 180 0]', '[pos:маленькие частицы эфира;0 210030000 1626.232 1333.446 205 0]', '[pos:маленькие частицы эфира;0 210030000 1739.963 1561.08 173 0]', '[pos:маленькие частицы эфира;0 210030000 1780.909 1544.588 205 0]', '[pos:маленькие частицы эфира;0 210030000 1555.106 1544.063 215 0]', '[pos:маленькие частицы эфира;0 210030000 1906.294 1437.828 165 0]', '[pos:маленькие частицы эфира;0 210030000 1817.005 1427.041 191 0]', '[pos:маленькие частицы эфира;0 210030000 1798.544 1329.204 169 0]', '[pos:маленькие частицы эфира;0 210030000 1554.377 1302.018 184 0]', '[pos:маленькие частицы эфира;0 210030000 1654.413 1507.75 178 0]'
                ]
        },
        {
            level: 25,
            region: 'Бертрон',
            name: 'маленькие частицы эфира',
            coords: [
                    '[pos:маленькие частицы эфира;0 210030000 2385.023 1729.246 180 0]', '[pos:маленькие частицы эфира;0 210030000 1553.84 1443.007 248 0]', '[pos:маленькие частицы эфира;0 210030000 1750.389 1442.997 260 0]', '[pos:маленькие частицы эфира;0 210030000 2229.132 1869.898 180 0]', '[pos:маленькие частицы эфира;0 210030000 2417.982 1863.855 180 0]', '[pos:маленькие частицы эфира;0 210030000 1674.292 1268.782 226 0]', '[pos:маленькие частицы эфира;0 210030000 1686.139 1437.239 210 0]', '[pos:маленькие частицы эфира;0 210030000 2207.452 1791.247 180 0]', '[pos:маленькие частицы эфира;0 210030000 2284.214 1716.283 180 0]', '[pos:маленькие частицы эфира;0 210030000 2290.0600 1940.205 180 0]', '[pos:маленькие частицы эфира;0 210030000 1960.673 1565.174 232 0]', '[pos:маленькие частицы эфира;0 210030000 1691.177 1569.333 241 0]', '[pos:маленькие частицы эфира;0 210030000 1696.51 1639.535 220 0]', '[pos:маленькие частицы эфира;0 210030000 2317.061 1757.378 180 0]', '[pos:маленькие частицы эфира;0 210030000 2243.511 1806.244 180 0]', '[pos:маленькие частицы эфира;0 210030000 1887.036 1704.215 239 0]', '[pos:маленькие частицы эфира;0 210030000 1787.302 1469.138 254 0]', '[pos:маленькие частицы эфира;0 210030000 2459.949 1777.966 180 0]', '[pos:маленькие частицы эфира;0 210030000 2340.848 1883.895 180 0]', '[pos:маленькие частицы эфира;0 210030000 1486.895 1383.96 254 0]'
                ]
        },
		 {
            level: 50,
            region: 'Бертрон',
            name: 'маленькие частицы эфира',
            coords: [
                    '[pos:маленькие частицы эфира;0 210030000 2370.426 1779.311 180 0]', '[pos:маленькие частицы эфира;0 210030000 2303.27 1849.942 183 0]', '[pos:маленькие частицы эфира;0 210030000 2504.511 1861.995 176 0]', '[pos:маленькие частицы эфира;0 210030000 1631.875 1472.427 273 0]', '[pos:маленькие частицы эфира;0 210030000 1773.613 1381.381 256 0]', '[pos:маленькие частицы эфира;0 210030000 1658.066 1594.903 289 0]', '[pos:маленькие частицы эфира;0 210030000 1823.077 1627.913 256 0]', '[pos:маленькие частицы эфира;0 210030000 1761.211 1343.351 273 0]', '[pos:маленькие частицы эфира;0 210030000 2259.176 1723.253 183 0]', '[pos:маленькие частицы эфира;0 210030000 2483.632 1743.96 183 0]', '[pos:маленькие частицы эфира;0 210030000 2381.5000 1682.497 148 0]', '[pos:маленькие частицы эфира;0 210030000 2258.082 1914.803 153 0]', '[pos:маленькие частицы эфира;0 210030000 1633.628 1396.403 265 0]', '[pos:маленькие частицы эфира;0 210030000 1528.765 1528.481 265 0]', '[pos:маленькие частицы эфира;0 210030000 1684.034 1712.746 289 0]', '[pos:маленькие частицы эфира;0 210030000 2196.042 1828.014 180 0]', '[pos:маленькие частицы эфира;0 210030000 2303.795 1910.554 180 0]', '[pos:маленькие частицы эфира;0 210030000 1651.319 1540.661 289 0]', '[pos:маленькие частицы эфира;0 210030000 1956.236 1498.438 265 0]', '[pos:маленькие частицы эфира;0 210030000 2230.985 1688.259 164 0]'
                ]
        },
		 {
            level: 75,
            region: 'Бертрон',
            name: 'маленькие частицы эфира',
			coords: [
                    '[pos:маленькие частицы эфира;0 210030000 2215.011 2008.904 196 0]', '[pos:маленькие частицы эфира;0 210030000 2528.503 1698.173 213 0]', '[pos:маленькие частицы эфира;0 210030000 2348.629 1754.258 193 0]', '[pos:маленькие частицы эфира;0 210030000 2551.573 1812.506 211 0]', '[pos:маленькие частицы эфира;0 210030000 2258.39 1829.625 217 0]', '[pos:маленькие частицы эфира;0 210030000 2474.846 1617.804 203 0]', '[pos:маленькие частицы эфира;0 210030000 2465.316 1683.772 220 0]', '[pos:маленькие частицы эфира;0 210030000 2255.477 1646.27 199 0]', '[pos:маленькие частицы эфира;0 210030000 2348.763 1896.272 207 0]', '[pos:маленькие частицы эфира;0 210030000 2583.982 1843.469 222 0]'
                ]
			},
		 {
            level: 100,
            region: 'Бертрон',
            name: 'большая частица эфира',
            coords: [
                    '[pos:большая частица эфира;0 210030000 2145.34 1921.0700 205 0]', '[pos:большая частица эфира;0 210030000 2184.31 1723.5 226 0]', '[pos:большая частица эфира;0 210030000 2194.24 1968.58 191 0]', '[pos:большая частица эфира;0 210030000 2274.63 1995.56 238 0]', '[pos:большая частица эфира;0 210030000 2279.17 1754.08 219 0]', '[pos:большая частица эфира;0 210030000 2333.99 1695.48 245 0]', '[pos:большая частица эфира;0 210030000 2334.5000 1619.68 234 0]', '[pos:большая частица эфира;0 210030000 2391.65 1613.21 189 0]', '[pos:большая частица эфира;0 210030000 2397.3000 1895.15 212 0]', '[pos:большая частица эфира;0 210030000 2397.86 1825.74 259 0]', '[pos:большая частица эфира;0 210030000 2415.69 1744.44 215 0]', '[pos:большая частица эфира;0 210030000 2458.54 1813.84 255 0]', '[pos:большая частица эфира;0 210030000 2518.34 1761.57 230 0]', '[pos:большая частица эфира;0 210030000 2562.48 1738.36 240 0]', '[pos:большая частица эфира;0 210030000 2579.91 1671.44 186 0]', '[pos:большая частица эфира;0 210030000 2579.913 1671.437 205 0]', '[pos:большая частица эфира;0 210030000 2279.17 1754.08 226 0]', '[pos:большая частица эфира;0 210030000 2232.81 1613.45 191 0]', '[pos:большая частица эфира;0 210030000 2334.502 1619.675 238 0]', '[pos:большая частица эфира;0 210030000 2333.99 1695.477 219 0]', '[pos:большая частица эфира;0 210030000 2562.481 1738.36 245 0]', '[pos:большая частица эфира;0 210030000 2194.235 1968.577 234 0]', '[pos:большая частица эфира;0 210030000 2184.31 1723.5 189 0]', '[pos:большая частица эфира;0 210030000 2391.65 1613.21 212 0]', '[pos:большая частица эфира;0 210030000 2518.34 1761.569 259 0]', '[pos:большая частица эфира;0 210030000 2397.0301 1895.15 215 0]', '[pos:большая частица эфира;0 210030000 2145.344 1921.068 255 0]', '[pos:большая частица эфира;0 210030000 2397.858 1825.738 230 0]', '[pos:большая частица эфира;0 210030000 2415.69 1744.445 240 0]', '[pos:большая частица эфира;0 210030000 2458.54 1813.84 186 0]', '[pos:большая частица эфира;0 210030000 2274.63 1995.56 205 0]'
                ]
			},
		 {
            level: 75,
            region: 'Элтенен',
            name: 'маленькие частицы эфира',
            coords: [
                    '[pos:маленькие частицы эфира;0 210020000 429.0766 2851.298 214 0]', '[pos:маленькие частицы эфира;0 210020000 490.3408 2689.296 204 0]', '[pos:маленькие частицы эфира;0 210020000 212.7014 2645.783 199 0]', '[pos:маленькие частицы эфира;0 210020000 359.8329 2836.666 211 0]', '[pos:маленькие частицы эфира;0 210020000 477.1773 2791.653 207 0]', '[pos:маленькие частицы эфира;0 210020000 420.42 2583 202 0]', '[pos:маленькие частицы эфира;0 210020000 357.9935 2901.206 218 0]', '[pos:маленькие частицы эфира;0 210020000 243.4 2831.13 196 0]', '[pos:маленькие частицы эфира;0 210020000 283.792 2539.648 222 0]', '[pos:маленькие частицы эфира;0 210020000 366.0746 2662.514 192 0]'
                ]
		},
		{
            level: 100,
            region: 'Элтенен',
            name: 'большая частица эфира',
			coords: [
                    '[pos:большая частица эфира;0 210020000 176.44 2777.39 238 0]', '[pos:большая частица эфира;0 210020000 457.8871 2583.238 223 0]', '[pos:большая частица эфира;0 210020000 285.44 2900.91 234 0]', '[pos:большая частица эфира;0 210020000 359.72 2531.1 248 0]', '[pos:большая частица эфира;0 210020000 274.06 2801.55 231 0]', '[pos:большая частица эфира;0 210020000 235.41 2714.32 242 0]', '[pos:большая частица эфира;0 210020000 416.7778 2714.121 220 0]', '[pos:большая частица эфира;0 210020000 225.76 2587.92 246 0]', '[pos:большая частица эфира;0 210020000 347.59 2598.81 227 0]', '[pos:большая частица эфира;0 210020000 508.9965 2774.77 252 0]', '[pos:большая частица эфира;0 210020000 233.1308 2892.97 277 0]', '[pos:большая частица эфира;0 210020000 306.016 2612.963 261 0]', '[pos:большая частица эфира;0 210020000 172.7405 2735.887 268 0]', '[pos:большая частица эфира;0 210020000 350.0986 2713.053 257 0]', '[pos:большая частица эфира;0 210020000 426.2901 2775.65 253 0]', '[pos:большая частица эфира;0 210020000 352.2062 2798.928 282 0]', '[pos:большая частица эфира;0 210020000 228.9981 2543.621 264 0]', '[pos:большая частица эфира;0 210020000 235.5502 2781.49 273 0]', '[pos:большая частица эфира;0 210020000 506.9107 2826.549 250 0]', '[pos:большая частица эфира;0 210020000 298.8054 2838.93 280 0]'
                ]
        },
		{
            level: 125 ,
            region: 'Элтенен',
            name: 'большая частица эфира',
			coords: [
                    '[pos:большая частица эфира;0 210020000 199.7455 2842.653 304 0]', '[pos:большая частица эфира;0 210020000 413.3197 2528.1 292 0]', '[pos:большая частица эфира;0 210020000 349.0855 2760.083 307 0]', '[pos:большая частица эфира;0 210020000 272.1128 2647.504 296 0]', '[pos:большая частица эфира;0 210020000 211.0447 2744.706 311 0]', '[pos:большая частица эфира;0 210020000 416.5296 2905.97 284 0]', '[pos:большая частица эфира;0 210020000 458.3485 2850.741 315 0]', '[pos:большая частица эфира;0 210020000 463.9368 2647.54 288 0]', '[pos:большая частица эфира;0 210020000 184.6479 2642.928 300 0]', '[pos:большая частица эфира;0 210020000 414.5811 2658.163 279 0]'
                ]
        },
		{
            level: 150 ,
            region: 'Элтенен',
            name: 'большая частица эфира',
			coords: [
                    '[pos:большая частица эфира;0 210020000 214.7511 2811.467 239 0]', '[pos:большая частица эфира;0 210020000 245.4075 2639.348 239 0]', '[pos:большая частица эфира;0 210020000 403.7288 2623.404 238 0]', '[pos:большая частица эфира;0 210020000 173.3148 2832.171 239 0]', '[pos:большая частица эфира;0 210020000 391.7007 2826.177 240 0]', '[pos:большая частица эфира;0 210020000 201.4237 2749.596 237 0]', '[pos:большая частица эфира;0 210020000 383.4684 2733.242 243 0]', '[pos:большая частица эфира;0 210020000 335.355 2863.398 240 0]', '[pos:большая частица эфира;0 210020000 257.2788 2607 241 0]', '[pos:большая частица эфира;0 210020000 335.3511 2658.493 241 0]'
                ]
        },
		{
            level: 175 ,
            region: 'Элтенен',
            name: 'большая частица эфира',
			coords: [
                    '[pos:большая частица эфира;0 210020000 400.8118 2800.222 313.04 0]', '[pos:большая частица эфира;0 210020000 169.8911 2700.395 307 0]', '[pos:большая частица эфира;0 210020000 158.2849 2757.427 307.04 0]', '[pos:большая частица эфира;0 210020000 207.3755 2610.384 310.04 0]', '[pos:большая частица эфира;0 210020000 334.91 2637.728 312.04 0]', '[pos:большая частица эфира;0 210020000 433.324 2620.441 310.04 0]', '[pos:большая частица эфира;0 210020000 276.51 273.74 40 0]', '[pos:большая частица эфира;0 210020000 397.2541 2873.103 315.04 0]', '[pos:большая частица эфира;0 210020000 401.0121 294.333 58 0]', '[pos:большая частица эфира;0 210020000 150.3304 2668.948 304.04 0]', '[pos:большая частица эфира;0 210020000 357.0524 182.1377 53 0]', '[pos:большая частица эфира;0 210020000 216.2281 301.4167 72 0]', '[pos:большая частица эфира;0 210020000 248.7528 2869.133 305 0]', '[pos:большая частица эфира;0 210020000 268.6717 204.4566 81 0]', '[pos:большая частица эфира;0 210020000 347.6596 335.2886 63 0]', '[pos:большая частица эфира;0 210020000 320.2148 2847.346 310.04 0]', '[pos:большая частица эфира;0 210020000 230.601 146.1443 48 0]', '[pos:большая частица эфира;0 210020000 177.7691 228.6421 76 0]', '[pos:большая частица эфира;0 210020000 192.2018 376.2498 45 0]', '[pos:большая частица эфира;0 210020000 328.0963 282.7588 67 0]'
                ]
        },
		{
            level: 200,
            region: 'Элтенен',
            name: 'сгусток эфира',
			coords: [
                    '[pos:сгусток эфира;0 210020000 153.4191 285.1814 120 0]', '[pos:сгусток эфира;0 210020000 187.5052 231.7501 91 0]', '[pos:сгусток эфира;0 210020000 339.8282 183.9615 107 0]', '[pos:сгусток эфира;0 210020000 347.5458 246.3414 127 0]', '[pos:сгусток эфира;0 210020000 182.0401 320.3334 117 0]', '[pos:сгусток эфира;0 210020000 231.6734 215.0994 111 0]', '[pos:сгусток эфира;0 210020000 262.6015 250.9642 86 0]', '[pos:сгусток эфира;0 210020000 305.1234 334.3805 95 0]', '[pos:сгусток эфира;0 210020000 372.6591 289.909 102 0]', '[pos:сгусток эфира;0 210020000 278.9096 337.851 123 0]', '[pos:сгусток эфира;0 210020000 178.3643 367.676 136 0]', '[pos:сгусток эфира;0 210020000 327.8044 245.57 170 0]', '[pos:сгусток эфира;0 210020000 271.4016 456.3359 140 0]', '[pos:сгусток эфира;0 210020000 205.5578 266.7541 152 0]', '[pos:сгусток эфира;0 210020000 411.1395 328.1042 145 0]', '[pos:сгусток эфира;0 210020000 183.3719 303.0521 158 0]', '[pos:сгусток эфира;0 210020000 233.8126 282.522 127 0]', '[pos:сгусток эфира;0 210020000 195.158 411.8024 164 0]', '[pos:сгусток эфира;0 210020000 145.3491 184.9705 131 0]', '[pos:сгусток эфира;0 210020000 268.6584 123.5818 149 0]'
                ]
        },
		{
            level: 225,
            region: 'Элтенен',
            name: 'сгусток эфира',
            coords: [
                    '[pos:сгусток эфира;0 210020000 321.2535 324.1246 283 0]', '[pos:сгусток эфира;0 210020000 352.2089 124.3153 277 0]', '[pos:сгусток эфира;0 210020000 119.654 351.147 182 0]', '[pos:сгусток эфира;0 210020000 126.7878 196.6683 209 0]', '[pos:сгусток эфира;0 210020000 231.5232 106.2471 204 0]', '[pos:сгусток эфира;0 210020000 288.29 301.23 265 0]', '[pos:сгусток эфира;0 210020000 90.27482 316.7151 213 0]', '[pos:сгусток эфира;0 210020000 318.7193 394.119 270 0]', '[pos:сгусток эфира;0 210020000 225.467 437.9956 186 0]', '[pos:сгусток эфира;0 210020000 273.4734 403.5522 292 0]', '[pos:сгусток эфира;0 210020000 182.6859 127.3233 297 0]', '[pos:сгусток эфира;0 210020000 334.3705 427.7889 192 0]', '[pos:сгусток эфира;0 210020000 300.783 222.9214 305 0]', '[pos:сгусток эфира;0 210020000 183.5298 186.894 177 0]', '[pos:сгусток эфира;0 210020000 215.9091 302.8912 300 0]', '[pos:сгусток эфира;0 210020000 275.755 123.1937 274 0]', '[pos:сгусток эфира;0 210020000 307.2232 278.3121 200 0]', '[pos:сгусток эфира;0 210020000 364.0286 341.3881 289 0]', '[pos:сгусток эфира;0 210020000 369.294 238.8354 195 0]', '[pos:сгусток эфира;0 210020000 223.8758 267.0185 173 0]'
                ]
        },
		{
            level: 250,
            region: 'Элтенен',
            name: 'сгусток эфира',
            coords: [
                    '[pos:сгусток эфира;0 210020000 83.92799 213.4318 262 0]', '[pos:сгусток эфира;0 210020000 402.387 375.4873 231 0]', '[pos:сгусток эфира;0 210020000 146.3824 363.1851 256 0]', '[pos:сгусток эфира;0 210020000 232.8843 359.9017 227 0]', '[pos:сгусток эфира;0 210020000 410.4509 219.2978 236 0]', '[pos:сгусток эфира;0 210020000 121.6006 349.2553 222 0]', '[pos:сгусток эфира;0 210020000 306.1902 122.5978 245 0]', '[pos:сгусток эфира;0 210020000 344.5616 305.2548 240 0]', '[pos:сгусток эфира;0 210020000 191.51 149.91 219 0]', '[pos:сгусток эфира;0 210020000 167.2587 204.8354 251 0]'
                ]
        },
		{
            level: 175,
            region: 'Интердика',
            name: 'большая частица эфира',
            coords: [
                    '[pos:большая частица эфира;0 210040000 2412.229 424.365 440 0]', '[pos:большая частица эфира;0 210040000 2638.816 415.8202 424 0]', '[pos:большая частица эфира;0 210040000 2473.403 473.4556 447 0]', '[pos:большая частица эфира;0 210040000 2582.842 451.4201 470 0]', '[pos:большая частица эфира;0 210040000 2553.096 433.2134 435 0]', '[pos:большая частица эфира;0 210040000 2416.76 280.8694 458 0]', '[pos:большая частица эфира;0 210040000 2583.658 350.6528 418 0]', '[pos:большая частица эфира;0 210040000 2559.856 277.9085 429 0]', '[pos:большая частица эфира;0 210040000 2627.023 323.4069 464 0]', '[pos:большая частица эфира;0 210040000 2383.152 339.7781 453 0]', '[pos:большая частица эфира;0 210040000 2614.698 2554.112 1574.1 0]'
                ]
        },
		{
            level: 200,
            region: 'Интердика',
            name: 'сгусток эфира',
            coords: [
                    '[pos:сгусток эфира;0 210040000 2443.49 408.4813 484 0]', '[pos:сгусток эфира;0 210040000 2444.196 334.0361 509 0]', '[pos:сгусток эфира;0 210040000 2520.46 368.16 473 0]', '[pos:сгусток эфира;0 210040000 2505.009 257.512 497 0]', '[pos:сгусток эфира;0 210040000 2515.57 463.2166 503 0]', '[pos:сгусток эфира;0 210040000 2478.845 303.3331 479 0]', '[pos:сгусток эфира;0 210040000 2628.524 372.7617 491 0]', '[pos:сгусток эфира;0 210040000 2415.584 460.9936 521 0]', '[pos:сгусток эфира;0 210040000 2587.269 410.5716 527 0]', '[pos:сгусток эфира;0 210040000 2392.167 301.6644 514 0]', '[pos:сгусток эфира;0 210040000 2583.666 295.6516 566 0]', '[pos:сгусток эфира;0 210040000 2395.701 403.1939 547 0]', '[pos:сгусток эфира;0 210040000 2649.439 375.3197 573 0]', '[pos:сгусток эфира;0 210040000 2531.987 312.1978 560 0]', '[pos:сгусток эфира;0 210040000 2514.597 332.6918 530 0]', '[pos:сгусток эфира;0 210040000 2541.959 476.7386 553 0]', '[pos:сгусток эфира;0 210040000 2420.099 393.8993 542 0]', '[pos:сгусток эфира;0 210040000 2659.117 438.851 578 0]', '[pos:сгусток эфира;0 210040000 2507.604 418.5591 584 0]', '[pos:сгусток эфира;0 210040000 2446.276 290.8535 536 0]'
                ]
        },
		{
            level: 225,
            region: 'Интердика',
            name: 'сгусток эфира',
            coords: [
                    '[pos:сгусток эфира;0 210020000 321.2535 324.1246 283 0]', '[pos:сгусток эфира;0 210020000 352.2089 124.3153 277 0]', '[pos:сгусток эфира;0 210020000 119.654 351.147 182 0]', '[pos:сгусток эфира;0 210020000 126.7878 196.6683 209 0]', '[pos:сгусток эфира;0 210020000 231.5232 106.2471 204 0]', '[pos:сгусток эфира;0 210020000 288.29 301.23 265 0]', '[pos:сгусток эфира;0 210020000 90.27482 316.7151 213 0]', '[pos:сгусток эфира;0 210020000 318.7193 394.119 270 0]', '[pos:сгусток эфира;0 210020000 225.467 437.9956 186 0]', '[pos:сгусток эфира;0 210020000 273.4734 403.5522 292 0]', '[pos:сгусток эфира;0 210020000 182.6859 127.3233 297 0]', '[pos:сгусток эфира;0 210020000 334.3705 427.7889 192 0]', '[pos:сгусток эфира;0 210020000 300.783 222.9214 305 0]', '[pos:сгусток эфира;0 210020000 183.5298 186.894 177 0]', '[pos:сгусток эфира;0 210020000 215.9091 302.8912 300 0]', '[pos:сгусток эфира;0 210020000 275.755 123.1937 274 0]', '[pos:сгусток эфира;0 210020000 307.2232 278.3121 200 0]', '[pos:сгусток эфира;0 210020000 364.0286 341.3881 289 0]', '[pos:сгусток эфира;0 210020000 369.294 238.8354 195 0]', '[pos:сгусток эфира;0 210020000 223.8758 267.0185 173 0]', '[pos:сгусток эфира;0 210040000 2456.205 452.6781 644 0]', '[pos:сгусток эфира;0 210040000 2497.615 294.2108 601 0]', '[pos:сгусток эфира;0 210040000 2622.507 436.228 626 0]', '[pos:сгусток эфира;0 210040000 2430.739 360.7804 607 0]', '[pos:сгусток эфира;0 210040000 2558.246 308.1693 633 0]', '[pos:сгусток эфира;0 210040000 2608.543 463.8209 613 0]', '[pos:сгусток эфира;0 210040000 2504.315 409.7968 590 0]', '[pos:сгусток эфира;0 210040000 2545.67 398.6357 619 0]', '[pos:сгусток эфира;0 210040000 2610.219 354.6045 596 0]', '[pos:сгусток эфира;0 210040000 2404.559 362.686 638 0]'
                ]
        },
		{
            level: 250,
            region: 'Интердика',
            name: 'сгусток эфира',
            coords: [
                    '[pos:сгусток эфира;0 210020000 83.92799 213.4318 262 0]', '[pos:сгусток эфира;0 210020000 402.387 375.4873 231 0]', '[pos:сгусток эфира;0 210020000 146.3824 363.1851 256 0]', '[pos:сгусток эфира;0 210020000 232.8843 359.9017 227 0]', '[pos:сгусток эфира;0 210020000 410.4509 219.2978 236 0]', '[pos:сгусток эфира;0 210020000 121.6006 349.2553 222 0]', '[pos:сгусток эфира;0 210020000 306.1902 122.5978 245 0]', '[pos:сгусток эфира;0 210020000 344.5616 305.2548 240 0]', '[pos:сгусток эфира;0 210020000 191.51 149.91 219 0]', '[pos:сгусток эфира;0 210020000 167.2587 204.8354 251 0]', '[pos:сгусток эфира;0 210040000 2403.392 440.5621 689 0]', '[pos:сгусток эфира;0 210040000 2483.825 433.08 652 0]', '[pos:сгусток эфира;0 210040000 2473.148 278.6773 661 0]', '[pos:сгусток эфира;0 210040000 2522.171 392.8633 683 0]', '[pos:сгусток эфира;0 210040000 2534.897 292.0829 667 0]', '[pos:сгусток эфира;0 210040000 2558.179 465.8145 677 0]', '[pos:сгусток эфира;0 210040000 2424.047 327.3115 655 0]', '[pos:сгусток эфира;0 210040000 2463.427 407.3224 650 0]', '[pos:сгусток эфира;0 210040000 2466.055 312.8975 646 0]', '[pos:сгусток эфира;0 210040000 2635.34 353.5818 672 0]'
                ]
        },
		{
            level: 275,
            region: 'Интердика',
            name: 'сгусток эфира',
            coords: [
                    '[pos:сгусток эфира;0 210040000 1059.221 2786.884 140 0]', '[pos:сгусток эфира;0 210040000 2491.378 350.5312 685 0]', '[pos:сгусток эфира;0 210040000 1105.098 2853.963 162 0]', '[pos:сгусток эфира;0 210040000 1037.62 2848.06 137 0]', '[pos:сгусток эфира;0 210040000 952.1729 2846.664 147 0]', '[pos:сгусток эфира;0 210040000 2496.529 404.628 692 0]', '[pos:сгусток эфира;0 210040000 1053.66 2893.237 155 0]', '[pos:сгусток эфира;0 210040000 2402.494 259.6833 673 0]', '[pos:сгусток эфира;0 210040000 1116.872 2822.998 159 0]', '[pos:сгусток эфира;0 210040000 2418.506 353.471 660 0]', '[pos:сгусток эфира;0 210040000 990.0566 2902.969 152 0]', '[pos:сгусток эфира;0 210040000 2559.636 523.2139 692 0]', '[pos:сгусток эфира;0 210040000 2571.954 249.6798 680 0]', '[pos:сгусток эфира;0 210040000 1002.569 2761.86 143 0]', '[pos:сгусток эфира;0 210040000 2384.385 267.0064 695 0]', '[pos:сгусток эфира;0 210040000 988.3188 2828.243 149 0]', '[pos:сгусток эфира;0 210040000 2360.215 360.5423 667 0]', '[pos:сгусток эфира;0 210040000 2365.426 410.1436 694 0]', '[pos:сгусток эфира;0 210040000 2607.619 393.9695 688 0]', '[pos:сгусток эфира;0 210040000 1068.605 2843.884 164 0]'
                ]
        },
		{
            level: 300,
            region: 'Интердика',
            name: 'пылающий эфир',
            coords: [
                    '[pos:пылающий эфир;0 210040000 1023.61 2850.7 0 0]', '[pos:пылающий эфир;0 210040000 1032.37 2920.6 0 0]', '[pos:пылающий эфир;0 210040000 1060.88 2866.21 0 0]', '[pos:пылающий эфир;0 210040000 1032.373 2920.598 193 0]', '[pos:пылающий эфир;0 210040000 1002.74 2885.339 188 0]', '[pos:пылающий эфир;0 210040000 941.223 2829.448 173 0]', '[pos:пылающий эфир;0 210040000 1075.885 2818.946 196 0]', '[pos:пылающий эфир;0 210040000 1060.881 2866.208 182 0]', '[pos:пылающий эфир;0 210040000 1023.612 2850.698 167 0]', '[pos:пылающий эфир;0 210040000 989.2361 2848.579 180 0]', '[pos:пылающий эфир;0 210040000 1039.516 2797.629 177 0]', '[pos:пылающий эфир;0 210040000 995.2378 2788.187 170 0]', '[pos:пылающий эфир;0 210040000 967.1051 2790.813 185 0]'
                ]
        },
		{
            level: 325,
            region: 'Интердика',
            name: 'пылающий эфир',
            coords: [
                    '[pos:пылающий эфир;0 210040000 1108.745 2882.348 200 0]', '[pos:пылающий эфир;0 210040000 969.0258 2754.529 210 0]', '[pos:пылающий эфир;0 210040000 968.0424 2903.691 213 0]', '[pos:пылающий эфир;0 210040000 1033.18 2769.842 203 0]', '[pos:пылающий эфир;0 210040000 981.1555 2863.368 217 0]', '[pos:пылающий эфир;0 210040000 1075.823 2879.129 197 0]', '[pos:пылающий эфир;0 210040000 931.3254 2799.114 220 0]', '[pos:пылающий эфир;0 210040000 1062.877 2928.202 225 0]', '[pos:пылающий эфир;0 210040000 1054.767 2762.375 207 0]', '[pos:пылающий эфир;0 210040000 1044.846 2873.127 222 0]'
                ]
        },
		{
            level: 350,
            region: 'Интердика',
            name: 'пылающий эфир',
            coords: [
                    '[pos:пылающий эфир;0 210040000 967.8113 2807.131 230 0]', '[pos:пылающий эфир;0 210040000 968.6202 2863.347 245 0]', '[pos:пылающий эфир;0 210040000 1031.545 2812.085 227 0]', '[pos:пылающий эфир;0 210040000 1052.321 2853.343 233 0]', '[pos:пылающий эфир;0 210040000 1020.237 2914.996 249 0]', '[pos:пылающий эфир;0 210040000 1098.074 2788.661 255 0]', '[pos:пылающий эфир;0 210040000 1004.302 2737.629 239 0]', '[pos:пылающий эфир;0 210040000 1090.404 2844.684 252 0]', '[pos:пылающий эфир;0 210040000 939.9419 2884.689 242 0]', '[pos:пылающий эфир;0 210040000 943.61 2775.645 237 0]'
                ]
        },
		{
            level: 375,
            region: 'Интердика',
            name: 'пылающий эфир',
            coords: [
                    '[pos:пылающий эфир;0 210040000 1015.879 2777.511 264 0]', '[pos:пылающий эфир;0 210040000 985.8727 2764.461 278 0]', '[pos:пылающий эфир;0 210040000 1086.186 2910.274 270 0]', '[pos:пылающий эфир;0 210040000 1084.514 2831.078 257 0]', '[pos:пылающий эфир;0 210040000 1042.94 2744.559 285 0]', '[pos:пылающий эфир;0 210040000 1008.384 2822.479 260 0]', '[pos:пылающий эфир;0 210040000 1075.122 2754.671 267 0]', '[pos:пылающий эфир;0 210040000 1051.706 2838.163 282 0]', '[pos:пылающий эфир;0 210040000 986.2119 2928.986 272 0]', '[pos:пылающий эфир;0 210040000 924.1332 2855.713 275 0]'
                ]
        },
		{
            level: 375,
            region: 'Ингинсон',
            name: 'пылающий эфир',
            coords: [
                    '[pos:пылающий эфир;0 210050000 2835.4937 223.79994 367.43195 0]', '[pos:пылающий эфир;0 210050000 2858.6292 521.7254 374.22034 0]', '[pos:пылающий эфир;0 210050000 2797.3379 510.05084 370.10117 0]', '[pos:пылающий эфир;0 210050000 2887.8152 447.30042 367.43195 0]', '[pos:пылающий эфир;0 210050000 2751.2874 451.95111 378.30283 0]', '[pos:пылающий эфир;0 210050000 2911.6506 364.11963 371.62979 0]', '[pos:пылающий эфир;0 210050000 2839.658 487.67474 367.43195 0]', '[pos:пылающий эфир;0 210050000 2792.4734 231.3222 372.40961 0]', '[pos:пылающий эфир;0 210050000 2809.2388 277.02765 367.43195 0]', '[pos:пылающий эфир;0 210050000 2896.8398 286.98175 367.43195 0]', '[pos:пылающий эфир;0 210050000 2900.4626 244.94247 367.43195 0]', '[pos:пылающий эфир;0 210050000 2859.6018 264.88641 371.65341 0]', '[pos:пылающий эфир;0 210050000 2742.3704 419.57349 373.33615 0]', '[pos:пылающий эфир;0 210050000 2771.0703 303.31494 367.43195 0]', '[pos:пылающий эфир;0 210050000 2728.2637 272.66937 378.36087 0]'
                ]
        },
		{
            level: 400,
            region: 'Ингинсон',
            name: 'магический эфир',
            coords: [
                    '[pos:магический эфир;0 210050000 2228.407 2117.5098 190.80725 0]', '[pos:магический эфир;0 210050000 877.99927 1085.3385 329.93689 0]', '[pos:магический эфир;0 210050000 2833.9075 256.14459 384.96277 0]', '[pos:магический эфир;0 210050000 2712.9978 293.99457 382.96741 0]', '[pos:магический эфир;0 210050000 2213.259 2324.3821 190.80725 0]', '[pos:магический эфир;0 210050000 999.92395 1053.631 249.93689 0]', '[pos:магический эфир;0 210050000 2233.6072 2191.2151 71.557251 0]', '[pos:магический эфир;0 210050000 2239.2593 2345.8606 191.30725 0]', '[pos:магический эфир;0 210050000 2899.5889 236.63942 384.96277 0]', '[pos:магический эфир;0 210050000 2189.5195 2324.6082 70.797379 0]', '[pos:магический эфир;0 210050000 2743.2959 233.53426 384.96277 0]', '[pos:магический эфир;0 210050000 2269.1016 2042.876 189.89153 0]', '[pos:магический эфир;0 210050000 2888.2034 551.2962 384.96277 0]', '[pos:магический эфир;0 210050000 892.77533 1095.3611 251.93689 0]', '[pos:магический эфир;0 210050000 835.1087 997.22998 251.93689 0]', '[pos:магический эфир;0 210050000 2818.3784 286.68365 384.96277 0]', '[pos:магический эфир;0 210050000 842.32758 953.74884 249.93689 0]', '[pos:магический эфир;0 210050000 2884.374 311.86813 391.28308 0]', '[pos:магический эфир;0 210050000 955.58643 1052.7211 249.93689 0]', '[pos:магический эфир;0 210050000 2836.0774 542.76306 384.96277 0]', '[pos:магический эфир;0 210050000 2958.0696 399.66064 390.10281 0]', '[pos:магический эфир;0 210050000 2918.0186 294.52026 384.96277 0]', '[pos:магический эфир;0 210050000 906.59296 1072.0391 251.93689 0]', '[pos:магический эфир;0 210050000 731.90192 1057.3925 250.05447 0]', '[pos:магический эфир;0 210050000 2786.2505 581.31281 384.96277 0]', '[pos:магический эфир;0 210050000 783.24103 1059.4047 329.93689 0]', '[pos:магический эфир;0 210050000 2257.571 2077.4678 71.549667 0]', '[pos:магический эфир;0 210050000 795.14801 984.67761 249.93689 0]', '[pos:магический эфир;0 210050000 2960.6572 304.95309 396.68619 0]', '[pos:магический эфир;0 210050000 2767.5522 433.42294 384.96277 0]', '[pos:магический эфир;0 210050000 755.8866 1076.4464 249.93689 0]', '[pos:магический эфир;0 210050000 820.14502 998.72034 331.93689 0]', '[pos:магический эфир;0 210050000 2917.0146 447.56039 380.71597 0]', '[pos:магический эфир;0 210050000 2835.5625 503.12018 380.07663 0]', '[pos:магический эфир;0 210050000 2225.4678 2318.2778 70.996918 0]', '[pos:магический эфир;0 210050000 2166.041 2293.3726 192.03221 0]', '[pos:магический эфир;0 210050000 2857.5144 486.36618 396.18661 0]', '[pos:магический эфир;0 210050000 746.00269 1036.7957 329.93689 0]', '[pos:магический эфир;0 210050000 2216.8765 2187.3716 191.67876 0]', '[pos:магический эфир;0 210050000 2285.8337 2243.668 190.06557 0]', '[pos:магический эфир;0 210050000 2222.7549 2348.3477 191.10851 0]', '[pos:магический эфир;0 210050000 2282.8931 2098.7202 191.80028 0]', '[pos:магический эфир;0 210050000 2220.7185 2098.9463 70.807251 0]', '[pos:магический эфир;0 210050000 850.06805 1060.4934 329.93689 0]', '[pos:магический эфир;0 210050000 848.6499 1038.8756 251.93689 0]', '[pos:магический эфир;0 210050000 2236.5464 2145.5449 70.932251 0]', '[pos:магический эфир;0 210050000 2236.762 2086.6177 190.81226 0]', '[pos:магический эфир;0 210050000 2736.6667 437.45474 381.57599 0]', '[pos:магический эфир;0 210050000 2874.8777 300.34366 384.96277 0]', '[pos:магический эфир;0 210050000 1015.318 1049.4375 329.93689 0]', '[pos:магический эфир;0 210050000 2258.251 2112.9878 70.932251 0]', '[pos:магический эфир;0 210050000 2785.0178 319.75354 392.19397 0]', '[pos:магический эфир;0 210050000 2803.9429 245.10503 384.96277 0]', '[pos:магический эфир;0 210050000 2826.7732 462.10907 382.1026 0]', '[pos:магический эфир;0 210050000 2921.6982 358.65485 384.96277 0]', '[pos:магический эфир;0 210050000 2304.5977 2028.1801 70.309265 0]', '[pos:магический эфир;0 210050000 2221.6221 2156.9475 192.22887 0]', '[pos:магический эфир;0 210050000 1031.2946 1024.9111 251.93689 0]', '[pos:магический эфир;0 210050000 1056.8959 1058.1597 331.93689 0]', '[pos:магический эфир;0 210050000 814.82288 1038.5575 251.93689 0]', '[pos:магический эфир;0 210050000 2285.3735 2058.4785 160.93048 0]', '[pos:магический эфир;0 210050000 825.03931 1095.6724 329.93689 0]', '[pos:магический эфир;0 210050000 811.18091 971.65619 249.93689 0]', '[pos:магический эфир;0 210050000 2171.198 2315.749 190.80725 0]', '[pos:магический эфир;0 210050000 2797.6362 192.13208 382.07932 0]', '[pos:магический эфир;0 210050000 944.07312 1076.9479 331.93689 0]', '[pos:магический эфир;0 210050000 2852.4941 124.33594 390.37399 0]', '[pos:магический эфир;0 210050000 2781.3381 288.73761 387.24896 0]', '[pos:магический эфир;0 210050000 2814.2603 480.87305 390.50928 0]', '[pos:магический эфир;0 210050000 2276.7903 2318.73 72.307251 0]', '[pos:магический эфир;0 210050000 2268.199 2349.7043 72.581436 0]', '[pos:магический эфир;0 210050000 793.21558 1103.6251 249.93689 0]', '[pos:магический эфир;0 210050000 2246.7202 2302.4514 191.43225 0]', '[pos:магический эфир;0 210050000 2765.5437 497.97171 384.96277 0]', '[pos:магический эфир;0 210050000 2143.2058 2347.1821 70.932251 0]', '[pos:магический эфир;0 210050000 863.87616 936.26019 327.23682 0]', '[pos:магический эфир;0 210050000 2212.8069 2138.084 190.80725 0]', '[pos:магический эфир;0 210050000 917.4743 1101.7153 329.93689 0]', '[pos:магический эфир;0 210050000 2268.2417 2220.2886 72.182251 0]', '[pos:магический эфир;0 210050000 2206.2485 2116.1292 70.807251 0]', '[pos:магический эфир;0 210050000 2930.5388 415.03571 383.93164 0]', '[pos:магический эфир;0 210050000 2717.9368 492.81558 390.00073 0]', '[pos:магический эфир;0 210050000 2792.9119 480.95856 384.96277 0]', '[pos:магический эфир;0 210050000 2866.4673 168.84331 381.45657 0]', '[pos:магический эфир;0 210050000 2306.1819 2260.6245 73.330368 0]', '[pos:магический эфир;0 210050000 778.9187 1021.5013 331.93689 0]', '[pos:магический эфир;0 210050000 774.17328 1129.3115 329.93689 0]', '[pos:магический эфир;0 210050000 2858.0894 229.33421 384.96277 0]', '[pos:магический эфир;0 210050000 989.71417 1062.397 331.93689 0]', '[pos:магический эфир;0 210050000 2719.7227 371.32025 384.96277 0]', '[pos:магический эфир;0 210050000 968.43518 1053.0874 251.93689 0]', '[pos:магический эфир;0 210050000 836.10614 1018.1766 331.93689 0]', '[pos:магический эфир;0 210050000 2910.7295 481.49673 391.35754 0]', '[pos:магический эфир;0 210050000 2293.2842 2280.3792 192.89926 0]'
                ]
        },
		{
            level: 425,
            region: 'Ингинсон',
            name: 'магический эфир',
            coords: [
                    '[pos:магический эфир;0 210050000 928.15833 1084.861 269.99475 0]', '[pos:магический эфир;0 210050000 890.95148 1069.0352 307.99475 0]', '[pos:магический эфир;0 210050000 2270.2134 2257.2354 171.32732 0]', '[pos:магический эфир;0 210050000 957.55511 1074.7544 309.99475 0]', '[pos:магический эфир;0 210050000 2283.1873 2044.7764 88.81395 0]', '[pos:магический эфир;0 210050000 2226.6648 2172.2913 170.75735 0]', '[pos:магический эфир;0 210050000 775.216 994.79578 271.99475 0]', '[pos:магический эфир;0 210050000 2282.7351 2302.519 171.73494 0]', '[pos:магический эфир;0 210050000 791.36359 1007.8005 309.99475 0]', '[pos:магический эфир;0 210050000 2236.8389 2325.1282 170.36641 0]', '[pos:магический эфир;0 210050000 2203.3774 2327.8413 89.861023 0]', '[pos:магический эфир;0 210050000 828.19159 968.36542 271.99475 0]', '[pos:магический эфир;0 210050000 2248.9116 2267.0691 92.655998 0]', '[pos:магический эфир;0 210050000 2213.5515 2157.5955 90.524757 0]', '[pos:магический эфир;0 210050000 2236.8389 2106.9512 170.05095 0]', '[pos:магический эфир;0 210050000 843.10901 944.05865 307.99475 0]', '[pos:магический эфир;0 210050000 2201.5688 2128.2036 170.05095 0]', '[pos:магический эфир;0 210050000 2198.5427 2106.8855 89.986023 0]', '[pos:магический эфир;0 210050000 2271.2046 2087.5073 170.89067 0]', '[pos:магический эфир;0 210050000 2181.4468 2333.2673 167.77701 0]', '[pos:магический эфир;0 210050000 2230.5083 2201.4568 90.611023 0]', '[pos:магический эфир;0 210050000 790.17603 1037.6531 310.99475 0]', '[pos:магический эфир;0 210050000 864.32123 1042.3029 271.99475 0]', '[pos:магический эфир;0 210050000 2241.3606 2075.5247 90.665367 0]', '[pos:магический эфир;0 210050000 2286.125 2281.8623 85.560837 0]', '[pos:магический эфир;0 210050000 832.90637 1045.8967 307.99475 0]', '[pos:магический эфир;0 210050000 2217.7603 2084.0503 170.05095 0]', '[pos:магический эфир;0 210050000 981.89355 1050.1849 271.99475 0]', '[pos:магический эфир;0 210050000 843.42255 969.81219 307.99475 0]', '[pos:магический эфир;0 210050000 763.57825 1092.1757 269.99475 0]', '[pos:магический эфир;0 210050000 2166.2117 2326.4189 89.736023 0]', '[pos:магический эфир;0 210050000 2258.5435 2342.9893 90.839951 0]', '[pos:магический эфир;0 210050000 806.80133 1020.0264 269.99475 0]', '[pos:магический эфир;0 210050000 859.00146 954.85931 271.99475 0]', '[pos:магический эфир;0 210050000 2239.7761 2196.2996 170.92839 0]', '[pos:магический эфир;0 210050000 2790.7273 489.5527 419.2879 0]', '[pos:магический эфир;0 210050000 2796.1072 309.85916 406.17398 0]', '[pos:магический эфир;0 210050000 2882.1985 246.14151 406.19089 0]', '[pos:магический эфир;0 210050000 2862.2373 533.46252 406.95673 0]', '[pos:магический эфир;0 210050000 2742.3711 407.58368 409.10895 0]', '[pos:магический эфир;0 210050000 2901.5457 349.47299 406.89709 0]', '[pos:магический эфир;0 210050000 2790.2996 255.81512 414.16629 0]', '[pos:магический эфир;0 210050000 2890.9927 307.26099 412.96866 0]', '[pos:магический эфир;0 210050000 2903.2197 283.35724 415.78079 0]', '[pos:магический эфир;0 210050000 2902.7629 472.87772 411.89084 0]', '[pos:магический эфир;0 210050000 2835.4734 202.0737 416.59659 0]', '[pos:магический эфир;0 210050000 2844.8232 465.30243 407.58365 0]', '[pos:магический эфир;0 210050000 2839.9866 506.19531 418.12531 0]', '[pos:магический эфир;0 210050000 2772.5479 434.01886 417.69235 0]', '[pos:магический эфир;0 210050000 2841.3279 289.95679 405.45612 0]', '[pos:магический эфир;0 210050000 2804.4263 463.91446 411.89084 0]', '[pos:магический эфир;0 210050000 2845.2632 246.14153 411.89084 0]', '[pos:магический эфир;0 210050000 2737.9744 296.8941 416.17926 0]', '[pos:магический эфир;0 210050000 2751.6052 468.70313 406.47308 0]', '[pos:магический эфир;0 210050000 2938.2559 423.28918 414.00266 0]'
                ]
        },
		{
            level: 450,
            region: 'Ингинсон',
            name: 'магический эфир',
            coords: [
                    '[pos:магический эфир;0 210050000 2223.0754 2206.679 110.89322 0]', '[pos:магический эфир;0 210050000 2202.7996 2143.8245 110.21282 0]', '[pos:магический эфир;0 210050000 2206.2725 2098.4299 110.28017 0]', '[pos:магический эфир;0 210050000 2236.5354 2171.1106 111.03693 0]', '[pos:магический эфир;0 210050000 2250.9229 2062.2134 150.82047 0]', '[pos:магический эфир;0 210050000 2275.8674 2055.1167 150.16452 0]', '[pos:магический эфир;0 210050000 2211.71 2168.0725 150.29453 0]', '[pos:магический эфир;0 210050000 932.78107 1062.5345 289.94287 0]', '[pos:магический эфир;0 210050000 2268.5349 2303.3254 154.41754 0]', '[pos:магический эфир;0 210050000 2275.2324 2029.9659 109.10297 0]', '[pos:магический эфир;0 210050000 849.04706 928.77753 289.94287 0]', '[pos:магический эфир;0 210050000 2291.6389 2265.1711 152.18259 0]', '[pos:магический эфир;0 210050000 2171.7925 2302.3333 110.83778 0]', '[pos:магический эфир;0 210050000 2204.5361 2313.2478 110.33782 0]', '[pos:магический эфир;0 210050000 761.78119 1015.2842 289.94287 0]', '[pos:магический эфир;0 210050000 1028.391 1043.5353 289.94287 0]', '[pos:магический эфир;0 210050000 916.53125 1060.6873 289.94287 0]', '[pos:магический эфир;0 210050000 2224.1326 2331.604 150.41452 0]', '[pos:магический эфир;0 210050000 874.05847 1061.447 289.94287 0]', '[pos:магический эфир;0 210050000 807.30621 1055.1095 289.94287 0]', '[pos:магический эфир;0 210050000 854.0379 1098.2904 289.94287 0]', '[pos:магический эфир;0 210050000 797.82892 959.62567 289.94287 0]', '[pos:магический эфир;0 210050000 2247.698 2213.0325 151.17867 0]', '[pos:магический эфир;0 210050000 2279.4495 2075.6086 111.71282 0]', '[pos:магический эфир;0 210050000 2257.084 2263.6106 111.95221 0]', '[pos:магический эфир;0 210050000 851.58441 991.12494 289.94287 0]', '[pos:магический эфир;0 210050000 2168.0715 2339.5417 150.16452 0]', '[pos:магический эфир;0 210050000 977.16949 1082.95 289.94287 0]', '[pos:магический эфир;0 210050000 820.94263 1018.7657 289.94287 0]', '[pos:магический эфир;0 210050000 767.12543 1037.1606 289.94287 0]', '[pos:магический эфир;0 210050000 815.33185 974.38458 289.94287 0]', '[pos:магический эфир;0 210050000 2260.8452 2360.3787 107.91586 0]', '[pos:магический эфир;0 210050000 829.10626 946.84814 289.94287 0]', '[pos:магический эфир;0 210050000 2228.1016 2136.8787 150.28952 0]', '[pos:магический эфир;0 210050000 2284.4106 2110.5847 150.98082 0]', '[pos:магический эфир;0 210050000 2816.0276 443.36508 422.97394 0]', '[pos:магический эфир;0 210050000 2737.9563 363.84088 426.19638 0]', '[pos:магический эфир;0 210050000 2852.9409 489.9693 429.92456 0]', '[pos:магический эфир;0 210050000 2925.7805 211.05594 426.19638 0]', '[pos:магический эфир;0 210050000 2901.5203 535.40033 420.28537 0]', '[pos:магический эфир;0 210050000 2967.1155 377.99384 432.14755 0]', '[pos:магический эфир;0 210050000 2819.5129 223.49612 423.66907 0]', '[pos:магический эфир;0 210050000 2764.7886 218.78217 432.97647 0]', '[pos:магический эфир;0 210050000 2925.1682 316.28149 424.03 0]', '[pos:магический эфир;0 210050000 2947.1235 522.86768 432.83502 0]', '[pos:магический эфир;0 210050000 2778.5806 536.78558 448.16537 0]', '[pos:магический эфир;0 210050000 2874.0869 160.62292 435.39301 0]', '[pos:магический эфир;0 210050000 2780.9148 307.62244 435.39301 0]', '[pos:магический эфир;0 210050000 2924.0532 426.73633 439.16989 0]', '[pos:магический эфир;0 210050000 2854.2859 580.8504 415.78848 0]'
                ]
        },
		{
            level: 475,
            region: 'Ингинсон',
            name: 'магический эфир',
            coords: [
                    '[pos:магический эфир;0 210050000 2264.3816 2239.1802 132.84927 0]', '[pos:магический эфир;0 210050000 2245.8264 2361.3135 131.60593 0]', '[pos:магический эфир;0 210050000 2216.8867 2114.8555 129.68202 0]', '[pos:магический эфир;0 210050000 2291.9966 2030.9888 129.68202 0]', '[pos:магический эфир;0 210050000 2241.6113 2128.1387 129.68202 0]', '[pos:магический эфир;0 210050000 2273.8853 2337.7803 127.63569 0]', '[pos:магический эфир;0 210050000 2206.999 2338.895 129.68202 0]', '[pos:магический эфир;0 210050000 2190.405 2312.9482 127.53307 0]', '[pos:магический эфир;0 210050000 2221.0952 2174.9033 129.68202 0]', '[pos:магический эфир;0 210050000 2130.9685 2348.5498 129.68202 0]', '[pos:магический эфир;0 210050000 2185.7954 2139.9053 129.68202 0]', '[pos:магический эфир;0 210050000 2156.312 2298.7678 129.68202 0]', '[pos:магический эфир;0 210050000 2252.1711 2198.1348 129.68202 0]', '[pos:магический эфир;0 210050000 2270.2737 2103.0969 129.68202 0]', '[pos:магический эфир;0 210050000 2251.4143 2288.4812 130.99103 0]', '[pos:магический эфир;0 210050000 2228.6379 2230.7192 129.68202 0]', '[pos:магический эфир;0 210050000 2225.0173 2078.9604 129.68202 0]', '[pos:магический эфир;0 210050000 2237.3875 2275.9753 129.68202 0]', '[pos:магический эфир;0 210050000 2239.2871 2201.114 129.68202 0]', '[pos:магический эфир;0 210050000 2214.6575 2312.3347 129.68202 0]', '[pos:магический эфир;0 210050000 2250.8853 2097.1458 129.68202 0]', '[pos:магический эфир;0 210050000 2246.5227 2338.2917 129.68202 0]', '[pos:магический эфир;0 210050000 2286.8586 2291.3174 129.68202 0]', '[pos:магический эфир;0 210050000 2266.9548 2060.8579 129.68202 0]', '[pos:магический эфир;0 210050000 2273.7014 2275.5151 129.68202 0]', '[pos:магический эфир;0 210050000 2299.1206 2242.8591 129.96777 0]', '[pos:магический эфир;0 210050000 2260.7029 2312.043 131.60593 0]', '[pos:магический эфир;0 210050000 2155.1052 2344.9292 127.53307 0]', '[pos:магический эфир;0 210050000 2234.3616 2312.7385 127.63569 0]', '[pos:магический эфир;0 210050000 2190.2422 2112.533 129.68202 0]'
                ]
        },
	]
};

   
    raceSelector.addEventListener("change", function () {
        const selectedRace = raceSelector.value;
        generateButtons(ingredientsData[selectedRace]);
    });

    function generateButtons(ingredients) {
        buttonsContainer.innerHTML = '';

        ingredients.forEach(ingredient => {
            const button = document.createElement("button");

           
            button.textContent = `ур.${ingredient.level}  ${ingredient.name}`;
			button.title = `Локація: ${ingredient.region}`; 

            button.addEventListener("click", function () {
                coordinatesTextarea.value = ingredient.coords.join('\n');
            });
            buttonsContainer.appendChild(button);
        });
    }

   
    generateButtons(ingredientsData['elyos']);
});


const copyButton = document.getElementById('copyButton');
const coordinatesTextarea = document.getElementById('coordinatesTextarea');
const copyMessage = document.getElementById('copyMessage');

document.querySelector('.back-button').addEventListener('click', () => {
    window.history.back();
});

function copyText() {
 
    coordinatesTextarea.select();
    coordinatesTextarea.setSelectionRange(0, 99999);
 
    document.execCommand('copy');
  
    copyMessage.classList.add('show');
  
    setTimeout(() => {
        copyMessage.classList.remove('show');
    }, 2000);
}

copyButton.addEventListener('click', copyText);
